source/_posts/translation/a-constructivist-manifesto.org
#+title: a constructivist manifesto / 一個構造主義者的宣言
#+author: Errett Bishop

* 題解

  - 原文來源
    書名 foundations of constructive analysis
    爲 Bishop 的最主要著作
    成書與 1967 年
    系統地介紹 構造主義 處理分析學的方式
    在 構造主義 的框架內 重新證明了許多古典定理
    因而受人尊敬與重視
  - 譯文取其第一章

* 排版

  - 排版用 雙文
    譯文在先 原文在後
    原文 譯文 段段交叉 以便讀者對比 並指正譯文中不當之處
  - 譯文中
    方形括號內的段落爲我的筆記

* 說數 / the descriptive basis of mathematics

*** 譯文

    - 數學之爲人之智力活動
      超越生理與環境

      - 我們所觀察到的生命系統的原理
        可能亦適用於其他世界的生物
        但是 其他世界的生物 也很可能遵循其他的原理

      - 物理世界的原理 更爲普世
        然而 還是可能想像 另外一個世界 爲不同的物理規則所主導

      數學之爲心智所創造
      不像 生命系統的原理 或 物理世界的原理
      這些自然之造物一般任意

      我們想像中的異形生物
      居住在另一個世界
      具有另一套生理結構
      這種異形生物所發展出的數學 本質上也將與我的相同

      如若相信如上所述 我們就入了陷阱

      - 數學之爲我們心智所創造
        我們的心智 當然很難想像 它能如何與我們現在對它的想像不同
        除非我們真的看見了不同的可能

      或許
      對於 不同類型智慧生物的數學活動
      我們該少做些預言

      再說
      我們相信數學具有超越性
      其務實之處 並非有關異形生物
      其實
      所信者 指導着數學的研究方向
      這種研究方向源於 對數學內蘊性的執着
      執着數學內蘊自身而於外無求

    - 數學主要關乎數
      即 正整數
      [下面 數 不加限定詞時 就指正整數]
      我們體會數
      正如 康德體會空間
      [當然 康德體會空間 而的幾何
       康德還體會時間 而得算數]

      我們心智之特性
      讓我們預先假設數和算數運算
      我們還傾向於相信
      這正是心智本身之特性

      數的理論
      源起於單位
      還有單位相繼
      還有數學歸納法
      對於如此發展而來的理論 我們深信不疑

      用克倫內克[Kronecker]的話說
        上帝創造正整數
      克倫內克若說
        上帝 爲人和其他有限生物的利益
        而創造正整數
      那他說的就更好了

      [西方宗教認爲 上帝無限 而人與其他生物有限
       下面的翻譯中 有時我會忽略 有限 這個限定詞]

      數學屬於人 而不屬於上帝
      我們並不關心正整數那些難以言說於人的性質
      當人要證明某個正整數存在時
      他必須說明如何找到這個正整數
      如果上帝自己也要做些數學
      讓他自己做自己的去吧

    - 幾乎與數同樣重要的
      是我們藉以由數攀升
      而構造更高級數學實體的方法

      這些構造方法
      關乎觀察已經構造出來的數學實體之間的關係
      在觀察的過程中
      我們自然構造出新的數學實體來

      起步階段我們能觀察到的關係是
      數的 序 和 算數運算

      從這些觀察 我們得到各種構造方法
        組某些數成對成組
        分某些數出整體
        聯某數於另一個

      這些構造方法給出了 集合 和 函數 的感念

    - 一個集合 不是只有空想存在之物
      只有當定義了之後 一個集合才存在
      爲定義一個集合
      我們要說明
      1. 如何構造其元素
      2. 如何判斷兩個元素相等

    - 函數也如此
      爲定義一個從 集合 A 到 集合 B 的函數
      我們需要說明
      1. 一個在有限時間內結束的算法
         把 A 的元素 轉化成 B 的元素
      2. 並且證明
         相等的 A 的兩個元素
         被轉化成
         相等的 B 的兩個元素

    - 以數爲基礎
      我們編織出 集合 與 函數 組成網絡
      這樣就得到了基本的數學結構
        有理數
        實數
        歐幾里得空間
        複數
        代數數
        希爾伯特空間
        典型群

      很多數學就實現在這些結構的框架內
      一切都與數相聯
      一切數學論斷
      終可歸結爲
        給以數
        我們可以做某些運算
        而得到某些結果

    - 數學來了一次飛躍
      從那些 可以具體構造出來的實體
      轉向了那些 假設可以構造出來的實體

      某種程度上 假設可構造的實體 一開始就有
        每當我們說
        所有正整數具有某個性質
        其實我們是在考錄某個正整數
        並假設可以構造出這個數

      然而如今我們更大膽了
      我們考錄 假設可構造的集合
      賦之以 假設可施行的操作
      限之以 某些公理
      如此我們引入了
        拓撲空間
        羣
        流形

      其動機來自於 學習具體構造的例子
      其理由在於
      由 假設的構造 所構建的理論
      可能適用於更多的具體構造的例子

      最近流行再做一次飛躍
      去研究 假設的假設構造
      [指範疇論]

      同樣動機和理由來自具體的例子
      而具體的例子又終歸爲數
      因此
      即便是最抽象的數學也有計算基礎

    - 數學的超越性要求
      數學研究不能被限制於 我能施行的計算
        或你能施行的計算
        或一百個人在一百年內用一百台計算機所能施行的計算
      任何在有限步驟內可以結束的計算
      都可以研究

      這不意謂着計算的效率沒有價值
      一個應用數學家 會把計算的效率視爲重中之重
      而形式主義數學家 注重優雅勝於效率

      數學
      應該 也必將 注重效率
        也許有損優雅時也將如此
      但是
      以效率爲重
      恐怕只有當 現實主義 盛行之時了
      在那之前
      我們首先要儘可能
      把數學置於一個現實主義基礎之上
      但並不關注效率問題

