translate/a-constructivist-manifesto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-25 Wed 09:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>a constructivist manifesto / 一個構造主義者的宣言</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="Errett Bishop" />
<link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
<div id="content">
<h1 class="title">a constructivist manifesto / 一個構造主義者的宣言</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde17d30">題解</a></li>
<li><a href="#org64c29e4">排版</a></li>
<li><a href="#orgd0a174">說數 / the descriptive basis of mathematics</a>
<ul>
<li><a href="#orgb18a46c">譯文</a></li>
<li><a href="#org7e7f4bd">原文</a></li>
<li><a href="#orgcec4bfd"><span class="todo _">記</span> 數學的超越性</a></li>
</ul>
</li>
<li><a href="#org8aab843">理想 / the idealistic component of mathematics</a>
<ul>
<li><a href="#org7539555">譯文</a></li>
<li><a href="#org33425d9">原文</a></li>
</ul>
</li>
<li><a href="#org44c0d73">構造 / the constructivization of mathematics</a>
<ul>
<li><a href="#orgedaeebe">譯文</a></li>
<li><a href="#orgb809f9c">原文</a></li>
<li><a href="#org239e6"><span class="todo _">記</span> 任何使人心悅誠服的論證都是證明</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgde17d30" class="outline-2">
<h2 id="orgde17d30">題解</h2>
<div class="outline-text-2" id="text-orgde17d30">
<ul class="org-ul">
<li><p>原文來源</p><p>書名 foundations of constructive analysis</p><p>爲 Bishop 的最主要著作</p><p>成書與 1967 年</p><p>系統地介紹 構造主義 處理分析學的方式</p><p>在 構造主義 的框架內 重新證明了許多古典定理</p><p>因而受人尊敬與重視</p></li>
<li><p>譯文取其第一章</p></li></ul>
</div>
</div>

<div id="outline-container-org64c29e4" class="outline-2">
<h2 id="org64c29e4">排版</h2>
<div class="outline-text-2" id="text-org64c29e4">
<ul class="org-ul">
<li><p>排版用 雙文</p><p>譯文在先 原文在後</p><p>原文 譯文 段段交叉 以便讀者對比 並指正譯文中不當之處</p></li>
<li><p>譯文中</p><p>方形括號內的段落爲我的筆記</p></li></ul>
</div>
</div>

<div id="outline-container-orgd0a174" class="outline-2">
<h2 id="orgd0a174">說數 / the descriptive basis of mathematics</h2>
<div class="outline-text-2" id="text-orgd0a174">
</div><div id="outline-container-orgb18a46c" class="outline-3">
<h3 id="orgb18a46c">譯文</h3>
<div class="outline-text-3" id="text-orgb18a46c">
<ul class="org-ul">
<li><p><p></p><p>數學之爲人之智力活動</p><p>超越生理與環境</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>我們所觀察到的生命系統的原理</p><p>可能亦適用於其他世界的生物</p><p>但是 其他世界的生物 也很可能遵循其他的原理</p></li></p><p></p><p><li><p>物理世界的原理 更爲普世</p><p>然而 還是可能想像 另外一個世界 爲不同的物理規則所主導</p></li></ul></p><p><p></p><p>數學之爲心智所創造</p><p>不像 生命系統的原理 或 物理世界的原理</p><p>這些自然之造物一般任意</p><p></p></p><p></p><p><p></p><p>我們想像中的異形生物</p><p>居住在另一個世界</p><p>具有另一套生理結構</p><p>這種異形生物所發展出的數學 本質上也將與我的相同</p><p></p></p><p></p><p><p></p><p>如若相信如上所述 我們入了陷阱</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>數學之爲我們心智所創造</p><p>我們的心智 當然很難想像 它能如何與我們現在對它的想像不同</p><p>除非我們真的看見了不同的可能</p></li></ul></p><p><p></p><p>但是</p><p>對於 不同類型智慧生物的數學活動</p><p>我們或許該少做些預言</p><p></p></p><p></p><p><p></p><p>再說</p><p>我們相信數學具有超越性</p><p>其務實之處 並非有關異形生物</p><p>其實</p><p>所信者 指導着數學的研究方向</p><p>這種研究方向源於 對數學內蘊性的執着</p><p>執着數學內蘊自身而於外無求</p><p></p></p></li>

<li><p><p></p><p>數學主要關乎數</p><p>即 正整數</p><p>[下面 數 不加限定詞時 就指正整數]</p><p>我們體會數</p><p>正如 康德體會空間</p><p></p></p><p></p><p><p></p><p>我們心智之特性</p><p>讓我們預先假設數和算數運算</p><p>我們還傾向於相信</p><p>這正是心智本身之特性</p><p></p></p><p></p><p><p></p><p>數的理論</p><p>源起於單位</p><p>還有單位相繼</p><p>還有數學歸納法</p><p>對於如此發展而來的理論 我們深信不疑</p><p></p></p><p></p><p><p></p><p>用克倫內克[Kronecker]的話說</p><p>  上帝創造正整數</p><p>克倫內克若說</p><p>  上帝 爲人和其他有限生物的利益</p><p>  而創造正整數</p><p>那他說的就更好了</p><p></p></p><p></p><p><p></p><p>[西方宗教認爲 上帝無限 而人與其他生物有限</p><p> 下面的翻譯中 有時我會忽略 有限 這個限定詞]</p><p></p></p><p></p><p><p></p><p>數學屬於人 而不屬於上帝</p><p>我們並不關心正整數那些難以言說於人的性質</p><p>當人要證明某個正整數存在時</p><p>他必須說明如何找到這個正整數</p><p>如果上帝自己也要做些數學</p><p>讓他自己做自己的去吧</p><p></p></p></li>

<li><p><p></p><p>幾乎與數同樣重要的</p><p>是我們藉以由數攀升</p><p>而構造更高級數學實體的方法</p><p></p></p><p></p><p><p></p><p>這些構造方法</p><p>關乎觀察已經構造出來的數學實體之間的關係</p><p>在觀察的過程中</p><p>我們自然構造出新的數學實體來</p><p></p></p><p></p><p><p></p><p>起步階段我們能觀察到的關係是</p><p>數的 序 和 算數運算</p><p></p></p><p></p><p><p></p><p>從這些觀察 我們得到各種構造方法</p><p>  組某些數成對成組</p><p>  分某些數出整體</p><p>  聯某數於另一個</p><p></p></p><p></p><p><p></p><p>這些構造方法給出了 集合 和 函數 的感念</p><p></p></p></li>

<li><p>一個集合 不是只有空想存在之物</p><p>只有當定義了之後 一個集合才存在</p><p>爲定義一個集合</p><p>我們要說明</p><p><ol class="org-ol"></p><p><li>如何構造其元素</li></p><p><li>如何判斷兩個元素相等</li></ol></p></li>

<li><p>函數也如此</p><p>爲定義一個從 集合 A 到 集合 B 的函數</p><p>我們需要說明</p><p><ol class="org-ol"></p><p><li>一個在有限時間內結束的算法</p><p>把 A 的元素 轉化成 B 的元素</li></p><p><li>並且證明</p><p>相等的 A 的兩個元素</p><p>被轉化成</p><p>相等的 B 的兩個元素</li></ol></p></li>

<li><p><p></p><p>以數爲基礎</p><p>我們編織出 集合 與 函數 組成網絡</p><p>這樣就得到了基本的數學結構</p><p>  有理數</p><p>  實數</p><p>  歐幾里得空間</p><p>  複數</p><p>  代數數</p><p>  希爾伯特空間</p><p>  典型群</p><p></p></p><p></p><p><p></p><p>很多數學就實現在這些結構的框架內</p><p>一切都與數相聯</p><p>一切數學論斷</p><p>終可歸結爲</p><p>  給以數</p><p>  我們可以做某些運算</p><p>  而得到某些結果</p><p></p></p></li>

<li><p><p></p><p>數學來了一次飛躍</p><p>從那些 可以具體構造出來的實體</p><p>轉向了那些 假設可以構造出來的實體</p><p></p></p><p></p><p><p></p><p>某種程度上 假設可構造的實體 一開始就有</p><p>  每當我們說</p><p>  所有正整數具有某個性質</p><p>  其實我們是在考錄某個正整數</p><p>  並假設可以構造出這個數</p><p></p></p><p></p><p><p></p><p>然而如今我們更大膽了</p><p>我們考錄 假設可構造的集合</p><p>賦之以 假設可施行的操作</p><p>限之以 某些公理</p><p>如此我們引入了</p><p>  拓撲空間</p><p>  羣</p><p>  流形</p><p></p></p><p></p><p><p></p><p>其動機來自於 學習具體構造的例子</p><p>其理由在於</p><p>由 假設的構造 所構建的理論</p><p>可能適用於更多的具體構造的例子</p><p></p></p><p></p><p><p></p><p>最近流行再做一次飛躍</p><p>去研究 假設的假設構造</p><p>[指範疇論]</p><p></p></p><p></p><p><p></p><p>同樣動機和理由來自具體的例子</p><p>而具體的例子又終歸爲數</p><p>因此</p><p>即便是最抽象的數學也有計算基礎</p><p></p></p></li>

<li><p><p></p><p>數學的超越性要求</p><p>數學研究不能被限制於 我能施行的計算</p><p>  或你能施行的計算</p><p>  或一百個人在一百年內用一百台計算機所能施行的計算</p><p>任何在有限步驟內可以結束的計算</p><p>都可以研究</p><p></p></p><p></p><p><p></p><p>這不意謂着計算的效率沒有價值</p><p>一個應用數學家 會把計算的效率視爲重中之重</p><p>而形式主義數學家 注重優雅勝於效率</p><p></p></p><p></p><p><p></p><p>數學</p><p>應該 也必將 注重效率</p><p>  也許有損優雅時也將如此</p><p>但是</p><p>以效率爲重</p><p>恐怕只有當 現實主義 盛行之時了</p><p>在那之前</p><p>我們首先要儘可能</p><p>把數學置於一個現實主義基礎之上</p><p>但並不關注效率問題</p><p></p></p></li></ul>
</div>
</div>
