source/_posts/translation/a-constructivist-manifesto.org
*** 原文

    - Mathematics is that portion of our intellectual activity
      which transcends our biology and our environment.

      - The principles of biology as we know them
        may apply to life forms on other worlds,
        yet there is no necessity for this to be so.

      - The principles of physics should be more universal,
        yet it is easy to imagine another universe
        governed by different physical laws.

      Mathematics, a creation of mind,
      is less arbitrary than biology or physics,
      creations of nature;

      the creatures we imagine inhabiting another world
      in another universe,
      with another biology
      and another physics,
      will develop a mathematics
      which in essence is the same as ours.

      In believing this we may be falling into a trap:

      - Mathematics being a creation of our mind,
        it is, of course, difficult to imagine
        how mathematics could be otherwise
        without actually making it so,

      but perhaps we should not presume to predict
      the course of the mathematical activities
      of all possible types of intelligence.

      On the otherhand,
      the pragmatic content of our belief
      in the transcendence of mathematics
      has nothing to do with alien forms of life.
      Rather it serves to give a direction to mathematical investigation,
      resulting from the insistence that
      mathematics be born of an inner necessity.

    - The primary concern of mathematics is number,
      and this means the positive integers.
      We feel about number the way Kant felt about space.

      The positive integers and their arithmetic are presupposed
      by the very nature of our intelligence and,
      we are tempted to believe,
      by the very nature of intelligence in general.

      The development of the theory of the positive integers
      from the primitive concept of the unit,
      the concept of adjoining a unit,
      and the process of mathematical induction
      carries complete conviction.

      In the words of Kronecker,
        the positive integers were created by God.
      Kronecker would have expressed it even better
      if he had said that
        the positive integers were created by God
        for the benefit of man
        (and other finite beings).

      Mathematics belongs to man, not to God.
      We are not interested in properties of the positive integers
      that have no descriptive meaning for finite man.
      When a man proves a positive integer to exist,
      he should show how to find it.
      If God has mathematics of his own that needs to be done,
      let him do it himself.

    - Almost equal in importance to number
      are the constructions by which we ascend from number
      to the higher levels of mathematical existence.

      These constructions involve the discovery
      of relationships among mathematical entities already constructed,
      in the process of which new mathematical entities are created.

      The relations which form the point of departure are
      the order and arithmetical relations of the positive integers.

      From these we construct various rules
        for pairing integers with one another,
        for separating out certain integers from the rest,
        and for associating one integer to another.

      Rules of this sort
      give rise to the notions of sets and functions.

    - A set is not an entity which has an ideal existence.
      A set exists only when it has been defined.
      To define a set we prescribe, at least implicitly,
      1. what we (the constructing intelligence) must do
         in order to construct an element of the set,
      2. and what we must do to show that
         two elements of the set are equal.

    - A similar remark applies to the definition of a function:
      in order to define a function from a set A to a set B,
      1. we prescribe a finite routine
         which leads from an element of A to an elementof B,
      2. and show that
         equal elements of A
         give rise to
         equal elements of B.

    - Building on the positive integers,
      weaving a web of ever more sets and more functions,
      we get the basic structures of mathematics:
        the rational number system,
        the real number system,
        the euclidean spaces,
        the complex number system,
        the algebraic number fields,
        Hilbert space,
        the classical groups,
        and so forth.

      Within the framework of these structures
      most mathematics is done.
      Everything attaches itself to number,
      and every mathematical statement
      ultimately expresses the fact that
        if we perform certain computations
        within the set of positive integers,
        we shall get certain results.

    - mathematics takes another leap,
      from the entity which is constructed in fact
      to the entity whose construction is hypothetical.

      To some extent
      hypothetical entities are present from the start:
        whenever we assert that
        every positive integer has a certain property,
        in essence we are considering a positive integer
        whose construction is hypothetical.

      But now we become bolder and consider a hypothetical set,
      endowed with hypothetical operations
      subject to certain axioms.
      In this way we introduce such structures as
        topological spaces,
        groups,
        and manifolds.

      The motivation for doing this
      comes from the study of concretely constructed examples,
      and the justification
      comes from the possibility of
      applying the theory of the hypothetical structure
      to the study of more than one specific example.

      Recently it has become fashionable
      to take another leap
      and study, as it were,
      a hypothetical hypothetical structure
        a hypothetical structure qua hypothetical structure.

      Again the motivations and justifications
      attach themselves to particular examples,
      and the examples
      attach themselves to numbers in the ultimate analysis.
      Thus even the most abstract mathematical statement
      has a computational basis.

    - The transcendence of mathematics demands that
      it should not be confined to computations that I can perform,
      or you can perform,
      or 100 men working 100 years
        with 100 digital computers can perform.
      Any computation that can be performed by a finite intelligence
        any computation that has a finite number of steps
      is permissible.

      This does not mean that
      no value is to be placed on the efficiency of a computation.
      An applied mathematician will prize a computation
      for its efficiency above all else,
      whereas in formal mathematics
      much attentionis paid to elegance
      and little to efficiency.

      Mathematics should and must concern itself with efficiency,
        perhaps to the detriment of elegance,
      but these matters will come to the fore
      only when realism has begun to prevail.
      Until then
      our first concern will be
      to put as much mathematics as possible
      on a realistic basis
      without close attention to questions of efficiency.

