translate/a-constructivist-manifesto.html

<div id="outline-container-org7e7f4bd" class="outline-3">
<h3 id="org7e7f4bd">原文</h3>
<div class="outline-text-3" id="text-org7e7f4bd">
<ul class="org-ul">
<li><p><p></p><p>Mathematics is that portion of our intellectual activity</p><p>which transcends our biology and our environment.</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>The principles of biology as we know them</p><p>may apply to life forms on other worlds,</p><p>yet there is no necessity for this to be so.</p></li></p><p></p><p><li><p>The principles of physics should be more universal,</p><p>yet it is easy to imagine another universe</p><p>governed by different physical laws.</p></li></ul></p><p><p></p><p>Mathematics, a creation of mind,</p><p>is less arbitrary than biology or physics,</p><p>creations of nature;</p><p></p></p><p></p><p><p></p><p>the creatures we imagine inhabiting another world</p><p>in another universe,</p><p>with another biology</p><p>and another physics,</p><p>will develop a mathematics</p><p>which in essence is the same as ours.</p><p></p></p><p></p><p><p></p><p>In believing this we may be falling into a trap:</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>Mathematics being a creation of our mind,</p><p>it is, of course, difficult to imagine</p><p>how mathematics could be otherwise</p><p>without actually making it so,</p></li></ul></p><p><p></p><p>but perhaps we should not presume to predict</p><p>the course of the mathematical activities</p><p>of all possible types of intelligence.</p><p></p></p><p></p><p><p></p><p>On the otherhand,</p><p>the pragmatic content of our belief</p><p>in the transcendence of mathematics</p><p>has nothing to do with alien forms of life.</p><p>Rather it serves to give a direction to mathematical investigation,</p><p>resulting from the insistence that</p><p>mathematics be born of an inner necessity.</p><p></p></p></li>

<li><p><p></p><p>The primary concern of mathematics is number,</p><p>and this means the positive integers.</p><p>We feel about number the way Kant felt about space.</p><p></p></p><p></p><p><p></p><p>The positive integers and their arithmetic are presupposed</p><p>by the very nature of our intelligence and,</p><p>we are tempted to believe,</p><p>by the very nature of intelligence in general.</p><p></p></p><p></p><p><p></p><p>The development of the theory of the positive integers</p><p>from the primitive concept of the unit,</p><p>the concept of adjoining a unit,</p><p>and the process of mathematical induction</p><p>carries complete conviction.</p><p></p></p><p></p><p><p></p><p>In the words of Kronecker,</p><p>  the positive integers were created by God.</p><p>Kronecker would have expressed it even better</p><p>if he had said that</p><p>  the positive integers were created by God</p><p>  for the benefit of man</p><p>  (and other finite beings).</p><p></p></p><p></p><p><p></p><p>Mathematics belongs to man, not to God.</p><p>We are not interested in properties of the positive integers</p><p>that have no descriptive meaning for finite man.</p><p>When a man proves a positive integer to exist,</p><p>he should show how to find it.</p><p>If God has mathematics of his own that needs to be done,</p><p>let him do it himself.</p><p></p></p></li>

<li><p><p></p><p>Almost equal in importance to number</p><p>are the constructions by which we ascend from number</p><p>to the higher levels of mathematical existence.</p><p></p></p><p></p><p><p></p><p>These constructions involve the discovery</p><p>of relationships among mathematical entities already constructed,</p><p>in the process of which new mathematical entities are created.</p><p></p></p><p></p><p><p></p><p>The relations which form the point of departure are</p><p>the order and arithmetical relations of the positive integers.</p><p></p></p><p></p><p><p></p><p>From these we construct various rules</p><p>  for pairing integers with one another,</p><p>  for separating out certain integers from the rest,</p><p>  and for associating one integer to another.</p><p></p></p><p></p><p><p></p><p>Rules of this sort</p><p>give rise to the notions of sets and functions.</p><p></p></p></li>

<li><p>A set is not an entity which has an ideal existence.</p><p>A set exists only when it has been defined.</p><p>To define a set we prescribe, at least implicitly,</p><p><ol class="org-ol"></p><p><li>what we (the constructing intelligence) must do</p><p>in order to constructan element of the set,</li></p><p><li>and what we must do to show that</p><p>two elements of the set are equal.</li></ol></p></li>

<li><p>A similar remark applies to the definition of a function:</p><p>in order to define a function from a set A to a set B,</p><p><ol class="org-ol"></p><p><li>we prescribe a finite routine</p><p>which leads from an element of A to an elementof B,</li></p><p><li>and show that</p><p>equal elements of A</p><p>give rise to</p><p>equal elements of B.</li></ol></p></li>

<li><p><p></p><p>Building on the positive integers,</p><p>weaving a web of ever more sets and more functions,</p><p>we get the basic structures of mathematics:</p><p>  the rational number system,</p><p>  the real number system,</p><p>  the euclidean spaces,</p><p>  the complex number system,</p><p>  the algebraic number fields,</p><p>  Hilbert space,</p><p>  the classical groups,</p><p>  and so forth.</p><p></p></p><p></p><p><p></p><p>Within the framework of these structures</p><p>most mathematics is done.</p><p>Everything attaches itself to number,</p><p>and every mathematical statement</p><p>ultimately expresses the fact that</p><p>  if we perform certain computations</p><p>  within the set of positive integers,</p><p>  we shall get certain results.</p><p></p></p></li>

<li><p><p></p><p>mathematics takes another leap,</p><p>from the entity which is constructed in fact</p><p>to the entity whose construction is hypothetical.</p><p></p></p><p></p><p><p></p><p>To some extent</p><p>hypothetical entities are present from the start:</p><p>  whenever we assert that</p><p>  every positive integer has a certain property,</p><p>  in essence we are considering a positive integer</p><p>  whose construction is hypothetical.</p><p></p></p><p></p><p><p></p><p>But now we become bolder and consider a hypothetical set,</p><p>endowed with hypothetical operations</p><p>subject to certain axioms.</p><p>In this way we introduce such structures as</p><p>  topological spaces,</p><p>  groups,</p><p>  and manifolds.</p><p></p></p><p></p><p><p></p><p>The motivation for doing this</p><p>comes from the study of concretely constructed examples,</p><p>and the justification</p><p>comes from the possibility of</p><p>applying the theory of the hypothetical structure</p><p>to the study of more than one specific example.</p><p></p></p><p></p><p><p></p><p>Recently it has become fashionable</p><p>to take another leap</p><p>and study, as it were,</p><p>a hypothetical hypothetical structure</p><p>  a hypothetical structure qua hypothetical structure.</p><p></p></p><p></p><p><p></p><p>Again the motivations and justifications</p><p>attach themselves to particular examples,</p><p>and the examples</p><p>attach themselves to numbers in the ultimate analysis.</p><p>Thus even the most abstract mathematical statement</p><p>has a computational basis.</p><p></p></p></li>

<li><p><p></p><p>The transcendence of mathematics demands that</p><p>it should not be confined to computations that I can perform,</p><p>or you can perform,</p><p>or 100 men working 100 years</p><p>  with 100 digital computers can perform.</p><p>Any computation that can be performed by a finite intelligence</p><p>  any computation that has a finite number of steps</p><p>is permissible.</p><p></p></p><p></p><p><p></p><p>This does not mean that</p><p>no value is to be placed on the efficiency of a computation.</p><p>An applied mathematician will prize a computation</p><p>for its efficiency above all else,</p><p>whereas in formal mathematics</p><p>much attentionis paid to elegance</p><p>and little to efficiency.</p><p></p></p><p></p><p><p></p><p>Mathematics should and must concern itself with efficiency,</p><p>  perhaps to the detriment of elegance,</p><p>but these matters will come to the fore</p><p>only when realism has begun to prevail.</p><p>Until then</p><p>our first concern will be</p><p>to put as much mathematics as possible</p><p>on a realistic basis</p><p>without close attention to questions of efficiency.</p><p></p></p></li></ul>
</div>
</div>
