source/_posts/translation/a-constructivist-manifesto.org
*** 記 數學的超越性

    - 在翻譯之前
      初讀文章時
      我覺得 所謂 數學的超越性
      是 Bishop
      先入一論點 而非 Bishop 所持
      順着這個論點說下去
      實際的用意是要反駁

    - 畢竟
      這個詞 經常被用來爲 非構造主義數學 做辯護

    - 但是
      Bishop 並沒有直接否定 數學的超越性
      而是在文末
      重新定義了這個詞
      以合乎自己對數學研究的分類
      之後這個詞轉而可以用來辯護 構造主義數學 了

* 理想 / the idealistic component of mathematics

*** 譯文

    - 幾何學是高度理想化的
        從 歐幾里得 還有古代
        到 笛卡爾的時代
      從公理展開理論
      而公理
      要麼是顯然的
      要麼反映真實世界的性質

      笛卡爾把幾何學劃歸到實數的理論
      十九世紀
      戴德金[Dedekind] 維爾斯特拉斯[Weierstrass] 和其他人
      通過把實數系統算數化
      而把空間化爲了具體對象 由純粹思想所創造

    - 不幸
      空間算數化 對數學許下的諾言
      並沒實現
      主要歸咎於 世紀之交 形式主義計劃的介入

      數學的形式化之成功
      引數學在錯誤的道路上走了下去

      既然 空間 數 還有所有東西
      都被放置在理想主義基質內
      就連正整數都有模棱兩可的計算存在
      那麼
      空間已經被算數化 這件事 就沒了效益

      數學成了集合的遊戲
      這個遊戲玩着還不錯
      具有極精確的規則
      然而
      這遊戲成了它自己存在的理由 [自由乎]
      但 其實它只代表了一類非常理想化的數學實體
      人們通通忽略了這一點

    - 當然
      理想主義傾向 在古希臘就已經出現在數學中了
      甚至可以說是主導了數學
      但是
      只是經由 形式主義 的繁盛發展
      才扼殺了
      算數化 本可以給我們的
      洞察數學本質的機會

    - 我們來看一看
      最基本的古典分析理論的結果
      是多麼缺乏計算意義
      觀察下面的斷言
      - 任意 有界非空實數集 A
        都有最小上界
        - 實數 b 是 A 的最小上界
          若 任意 a 屬於 A
          有 a 小於等於 b
          並且 存在 A 中的元素
          任意地靠近 b

      爲避免不必要的複雜
      我們來考慮它的推論
      - 任意 有界有理數列 {x(k)}
        都有最小上界 b (在實數集中)

      如果這個論斷是 構造性有效的
      那麼我們計算 b 這個實數的方式
      就是去計算它的 任意精度的 有理數逼近
      我們可以編程以讓計算機幫我們計算
      例如
      計算機可以被編程而一個一個地生成
      序列 {b(k), m(k)} 的元素
      其中 b(k) 是有理數
      而 m(k) 是正整數 滿足
      1. x(j) <= b(k) + 1/k
         對於所有 j 和 k
      2. x(m(k)) >= b(k) - 1/k
         對於所有 k

      除非 有一個一般方法 M
      能用以 給每個有界有理序列
      生成這種計算機程序
      那麼 按照 構造主義 的標準
      我們就不能說
      - 任意 有界有理數列 {x(k)}
        都有最小上界 b (在實數集中)

      來看看這個 一般方法 M 的威力吧
      考慮
      項僅爲 0 或 1 的序列 {n(k)}
      用 一般方法 M
      我們生成了一個程序來計算 {b(k), m(k)}
      來看一看取 n = 3 時的情況
      設 N = m(3)
      1. n(j) <= b(3) + 1/3
         for all positive integers j
      2. n(N) >= b(3) - 1/3

      而 n(N) = 0 或 1
      若 n(N) = 0
      則 (1) 和 (2) 蘊含
        n(j) <= b(3) + 1/3 <= n(N) + 2/3 = 2/3
        對與所有 j
      因爲 n(j) = 0 或 1
      所以結論是
        n(j) = 0
        對與所有 j
      這樣
      對於每個
      項僅爲 0 或 1 的序列 {n(k)}
      一般方法 M 能夠
      1. 生成一個 n(k) 都爲零的證明
      2. 生成一個 正整數 N 使得 n(N) = 1
      當然
      這個 一般方法 M 並不存在
      沒人有望能夠找到這個方法
      因爲這個方法
      能夠解決很多有名的數學未解之難題
      費瑪大定理 [現在已經證明]
      四色定理 [現在已經在計算機的幫助下證明]
      黎曼假設 等等爲例
      因爲這些問題都可以被化爲
      項僅爲 0 或 1 的序列 {n(k)}
      而需要證明的就是
      或者 n(k) = 0 對所有 k
      或者 n(k) = 1 對某些 k

    - 做爲另一個例子
      考慮直覺上非常顯然的中值定理
      - 每個 閉區 [0,1] 間上的連續函數 f
        滿足 f(0) < 0 且 f(1) > 0
        都在某一點 x0 爲零

      這個定理可以從 最小上界定理推出
      只要取 x0 爲
      滿足 f(x) < 0 的 x 的集合
      的最小上界

      用 最小上界定理來 證明中值定理
      這還並不代表 中值定理 不具有構造意義
      只能說是這個證明 不具有構造意義

      只要仔細觀察一下
      就能發現 中值定理 不具有構造意義
      我們展示如下

      [這裏的證明是我重新敘述的]

      先做一些輔助構造
      設 {n(k)} 爲項爲 -1 或 0 或 1 的數列
      定義實數 a 爲
        a = 求和 3^-k * n(k)
            其中 k 從 1 到 正無窮

      這個構造的特點是
        {n(k)} 如果存在非零項
        那麼其首個非零項 決定 a 的正負
        若 首個非零項 爲 1 則 a >= 0
        若 首個非零項 爲 -1 則 a <= 0
        判定 任意一個 {n(k)} 的首個非零項
          爲 1
          爲 -1
          不存在首個非零項 即 全部都是 0
        的一般方法是不存在的
        這樣
        判定 a >= 0
        或 a <= 0
        的一般方法也是不存在的

      取 區間 [0,1] 上的連續函數 f 滿足
        f(0) = -1
        f(1) = 1
        f(1/3) = f(2/3) = a
      讓 f 在下面每個區間都是線性函數即可
        [0,1/3]
        [1/3,2/3]
        [2/3,1]

      如果 中值定理 在構造主義意義下 有效
      那麼 就有 x0 使得 f(x0) = 0
        x0 做爲實數
        是由 計算任意精度有理近似 的函數 定義的

      當計算得 x0 之後
      如果發現 x0 < 2/3 那麼就有 a >= 0
      如果發現 x0 > 1/3 那麼就有 a <= 0
      所以說
      如果算得了 x0
      就得完成了上面輔助構造中的 不可能完成的判定

      所以 中值定理 不具有構造意義

    - 布勞維爾[Brouwer] 對抗 形式主義的進展
      並試圖 把數學從邏輯中解脫出來
      通過
        給每個數學定理和數學證明
        以實用的詮釋
      他想要加強數學

      他的計劃沒有獲得支持

      他是個無親和力的展示者
      是個不圓滑的倡導人
      爭先挑戰希爾伯特的偉大威望
      挑戰理想主義數學以最少的代價獲得最多的成果這一事實

      更有甚者
      布勞維爾 自己的思想體系裏
      就有 理想唯心的蹤跡 加以形而上學的空斷
      由此
      具體數學活動
      受構造主義的哲學偏見所累

      一種關於否定的演算被發展出來
      依靠它就能避免獲得具體的構造果
      難怪
      布勞維爾的某些告誡 之後被形式化
      由此發展出 所謂 直覺主義數論
      如此得來的形式系統 其實沒有一點構造性價值

      公道地說 布勞維爾 並沒有參與這種形式化現實的活動
      要怪就怪邏輯學家
      他們導致
      很多自認爲 瞭解構造主義觀點的 數學家
      腦子裏想的其實是一個不足掛齒的形式體系
      或者 把構造主義與遞歸函數理論 混爲一談

    - 布勞維爾 深陷 形而上學的空斷
      只爲改進關於 連續統[continuum] 的理論
      強行揣測 連續統的性質
      成了布勞維爾和邏輯學家的魔怔

      這引邏輯學家走向扭曲
      發展各種形式體系
      種種都脫離實際
      你解釋我 我解釋你
      寄希望於 連續統的性質 終有一天將自行顯現

      這引起布勞維爾揮之不去的懷疑
      他感覺 除非他親自出馬加以阻止
      否則 連續統 將變爲 離散的
      他爲此引入了 自由選擇序列[free-choice sequences]
      用以構造連續統
      這樣 連續統 就不能是離散的了
      只因定義上的差異
      這使得數學變得非常怪異
      變得不合數學家的胃口
      這註定毀了布勞維爾的計劃
      這很可惜
      因爲對於古典數學的缺陷
      布勞維爾有卓越的洞見
      且他英雄壯舉 預要改正數學

