translate/a-constructivist-manifesto.html

<div id="outline-container-orgcec4bfd" class="outline-3">
<h3 id="orgcec4bfd"><span class="todo _">記</span> 數學的超越性</h3>
<div class="outline-text-3" id="text-orgcec4bfd">
<ul class="org-ul">
<li><p>在翻譯之前</p><p>初讀文章時</p><p>我覺得 所謂 數學的超越性</p><p>是 Bishop</p><p>先入一論點 而非 Bishop 所持</p><p>順着這個論點說下去</p><p>實際的用意是要反駁</p></li>

<li><p>畢竟</p><p>這個詞 經常被用來爲 非構造主義數學 做辯護</p></li>

<li><p>但是</p><p>Bishop 並沒有直接否定 數學的超越性</p><p>而是在文末</p><p>重新定義了這個詞</p><p>以合乎自己對數學研究的分類</p><p>之後這個詞轉而可以用來辯護 構造主義數學 了</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org8aab843" class="outline-2">
<h2 id="org8aab843">理想 / the idealistic component of mathematics</h2>
<div class="outline-text-2" id="text-org8aab843">
</div><div id="outline-container-org7539555" class="outline-3">
<h3 id="org7539555">譯文</h3>
<div class="outline-text-3" id="text-org7539555">
<ul class="org-ul">
<li><p><p></p><p>幾何學是高度理想化的</p><p>  從 歐幾里得 還有古代</p><p>  到 笛卡爾的時代</p><p>從公理展開理論</p><p>而公理</p><p>要麼是顯然的</p><p>要麼反映真實世界的性質</p><p></p></p><p></p><p><p></p><p>笛卡爾把幾何學劃歸到實數的理論</p><p>十九世紀</p><p>戴德金[Dedekind] 維爾斯特拉斯[Weierstrass] 和其他人</p><p>通過把實數系統算數化</p><p>而把空間化爲了具體對象 由純粹思想所創造</p><p></p></p></li>

<li><p><p></p><p>不幸</p><p>空間算數化 對數學許下的諾言</p><p>並沒實現</p><p>主要歸咎於 世紀之交 形式主義計劃的介入</p><p></p></p><p></p><p><p></p><p>數學的形式化之成功</p><p>引數學在錯誤的道路上走了下去</p><p></p></p><p></p><p><p></p><p>既然 空間 數 還有所有東西</p><p>都被放置在理想主義基質內</p><p>就連正整數都有模棱兩可的計算存在</p><p>那麼</p><p>空間已經被算數化 這件事 就沒了效益</p><p></p></p><p></p><p><p></p><p>數學成了集合的遊戲</p><p>這個遊戲玩着還不錯</p><p>具有極精確的規則</p><p>然而</p><p>這遊戲成了它自己存在的理由 [自由乎]</p><p>但 其實它只代表了一類非常理想化的數學實體</p><p>人們通通忽略了這一點</p><p></p></p></li>

<li><p>當然</p><p>理想主義傾向 在古希臘就已經出現在數學中了</p><p>甚至可以說是主導了數學</p><p>但是</p><p>只是經由 形式主義 的繁盛發展</p><p>才扼殺了</p><p>算數化 本可以給我們的</p><p>洞察數學本質的機會</p></li>

<li><p><p></p><p>我們來看一看</p><p>最基本的古典分析理論的結果</p><p>是多麼缺乏計算意義</p><p>觀察下面的斷言</p><p></p></p><p><ul class="org-ul"></p><p><li><p>任意 有界非空實數集 A</p><p>都有最小上界</p><p><ul class="org-ul"></p><p><li><p>實數 b 是 A 的最小上界</p><p>若 任意 a 屬於 A</p><p>有 a 小於等於 b</p><p>並且 存在 A 中的元素</p><p>任意地靠近 b</p></li></ul></p></li></ul></p><p><p></p><p>爲避免不必要的複雜</p><p>我們來考慮它的推論</p><p></p></p><p><ul class="org-ul"></p><p><li><p>任意 有界有理數列 {x(k)}</p><p>都有最小上界 b (在實數集中)</p></li></ul></p><p><p></p><p>如果這個論斷是 構造性有效的</p><p>那麼我們計算 b 這個實數的方式</p><p>就是去計算它的 任意精度的 有理數逼近</p><p>我們可以編程以讓計算機幫我們計算</p><p>例如</p><p>計算機可以被編程而一個一個地生成</p><p>序列 {b(k), m(k)} 的元素</p><p>其中 b(k) 是有理數</p><p>而 m(k) 是正整數 滿足</p><p></p></p><p><ol class="org-ol"></p><p><li>x(j) &lt;= b(k) + 1/k</p><p>對於所有 j 和 k</li></p><p><li>x(m(k)) &gt;= b(k) - 1/k</p><p>對於所有 k</li></ol></p><p><p></p><p>除非 有一個一般方法 M</p><p>能用以 給每個有界有理序列</p><p>生成這種計算機程序</p><p>那麼 按照 構造主義 的標準</p><p>我們就不能說</p><p></p></p><p><ul class="org-ul"></p><p><li><p>任意 有界有理數列 {x(k)}</p><p>都有最小上界 b (在實數集中)</p></li></ul></p><p><p></p><p>來看看這個 一般方法 M 的威力吧</p><p>考慮</p><p>項僅爲 0 或 1 的序列 {n(k)}</p><p>用 一般方法 M</p><p>我們生成了一個程序來計算 {b(k), m(k)}</p><p>來看一看取 n = 3 時的情況</p><p>設 N = m(3)</p><p></p></p><p><ol class="org-ol"></p><p><li>n(j) &lt;= b(3) + 1/3</p><p>for all positive integers j</li></p><p><li>n(N) &gt;= b(3) - 1/3</li></ol></p><p><p></p><p>而 n(N) = 0 或 1</p><p>若 n(N) = 0</p><p>則 (1) 和 (2) 蘊含</p><p>  n(j) &lt;= b(3) + 1/3 &lt;= n(N) + 2/3 = 2/3</p><p>  對與所有 j</p><p>因爲 n(j) = 0 或 1</p><p>所以結論是</p><p>  n(j) = 0</p><p>  對與所有 j</p><p>這樣</p><p>對於每個</p><p>項僅爲 0 或 1 的序列 {n(k)}</p><p>一般方法 M 能夠</p><p></p></p><p><ol class="org-ol"></p><p><li>生成一個 n(k) 都爲零的證明</li></p><p><li>生成一個 正整數 N 使得 n(N) = 1</li></ol></p><p><p></p><p>當然</p><p>這個 一般方法 M 並不存在</p><p>沒人有望能夠找到這個方法</p><p>因爲這個方法</p><p>能夠解決很多有名的數學未解之難題</p><p>費瑪大定理 [現在已經證明]</p><p>四色定理 [現在已經在計算機的幫助下證明]</p><p>黎曼假設 等等爲例</p><p>因爲這些問題都可以被化爲</p><p>項僅爲 0 或 1 的序列 {n(k)}</p><p>而需要證明的就是</p><p>或者 n(k) = 0 對所有 k</p><p>或者 n(k) = 1 對某些 k</p><p></p></p></li>

<li><p><p></p><p>做爲另一個例子</p><p>考慮直覺上非常顯然的中值定理</p><p></p></p><p><ul class="org-ul"></p><p><li><p>每個 閉區 [0,1] 間上的連續函數 f</p><p>滿足 f(0) &lt; 0 且 f(1) &gt; 0</p><p>都在某一點 x0 爲零</p></li></ul></p><p><p></p><p>這個定理可以從 最小上界定理推出</p><p>只要取 x0 爲</p><p>滿足 f(x) &lt; 0 的 x 的集合</p><p>的最小上界</p><p></p></p><p></p><p><p></p><p>用 最小上界定理來 證明中值定理</p><p>這還並不代表 中值定理 不具有構造意義</p><p>只能說是這個證明 不具有構造意義</p><p></p></p><p></p><p><p></p><p>只要仔細觀察一下</p><p>就能發現 中值定理 不具有構造意義</p><p>我們展示如下</p><p></p></p><p></p><p><p></p><p>[這裏的證明是我重新敘述的]</p><p></p></p><p></p><p><p></p><p>先做一些輔助構造</p><p>設 {n(k)} 爲項爲 -1 或 0 或 1 的數列</p><p>定義實數 a 爲</p><p>  a = 求和 3<sup>-k</sup> * n(k)</p><p>      其中 k 從 1 到 正無窮</p><p></p></p><p></p><p><p></p><p>這個構造的特點是</p><p>  {n(k)} 如果存在非零項</p><p>  那麼其首個非零項 決定 a 的正負</p><p>  若 首個非零項 爲 1 則 a &gt;= 0</p><p>  若 首個非零項 爲 -1 則 a &lt;= 0</p><p>  判定 任意一個 {n(k)} 的首個非零項</p><p>    爲 1</p><p>    爲 -1</p><p>    不存在首個非零項 即 全部都是 0</p><p>  的一般方法是不存在的</p><p>  這樣</p><p>  判定 a &gt;= 0</p><p>  或 a &lt;= 0</p><p>  的一般方法也是不存在的</p><p></p></p><p></p><p><p></p><p>取 區間 [0,1] 上的連續函數 f 滿足</p><p>  f(0) = -1</p><p>  f(1) = 1</p><p>  f(1/3) = f(2/3) = a</p><p>讓 f 在下面每個區間都是線性函數即可</p><p>  [0,1/3]</p><p>  [1/3,2/3]</p><p>  [2/3,1]</p><p></p></p><p></p><p><p></p><p>如果 中值定理 在構造主義意義下 有效</p><p>那麼 就有 x0 使得 f(x0) = 0</p><p>  x0 做爲實數</p><p>  是由 計算任意精度有理近似 的函數 定義的</p><p></p></p><p></p><p><p></p><p>當計算得 x0 之後</p><p>如果發現 x0 &lt; 2/3 那麼就有 a &gt;= 0</p><p>如果發現 x0 &gt; 1/3 那麼就有 a &lt;= 0</p><p>所以說</p><p>如果算得了 x0</p><p>就得完成了上面輔助構造中的 不可能完成的判定</p><p></p></p><p></p><p><p></p><p>所以 中值定理 不具有構造意義</p><p></p></p></li>

<li><p><p></p><p>布勞維爾[Brouwer] 對抗 形式主義的進展</p><p>並試圖 把數學從邏輯中解脫出來</p><p>通過</p><p>  給每個數學定理和數學證明</p><p>  以實用的詮釋</p><p>他想要加強數學</p><p></p></p><p></p><p><p></p><p>他的計劃沒有獲得支持</p><p></p></p><p></p><p><p></p><p>他是個無親和力的展示者</p><p>是個不圓滑的倡導人</p><p>爭先挑戰希爾伯特的偉大威望</p><p>挑戰理想主義數學以最少的代價獲得最多的成果這一事實</p><p></p></p><p></p><p><p></p><p>更有甚者</p><p>布勞維爾 自己的思想體系裏</p><p>就有 理想唯心的蹤跡 加以形而上學的空斷</p><p>由此</p><p>具體數學活動</p><p>受構造主義的哲學偏見所累</p><p></p></p><p></p><p><p></p><p>一種關於否定的演算被發展出來</p><p>依靠它就能避免獲得具體的構造果</p><p>難怪</p><p>布勞維爾的某些告誡 之後被形式化</p><p>由此發展出 所謂 直覺主義數論</p><p>如此得來的形式系統 其實沒有一點構造性價值</p><p></p></p><p></p><p><p></p><p>公道地說 布勞維爾 並沒有參與這種形式化現實的活動</p><p>要怪就怪邏輯學家</p><p>他們導致</p><p>很多自認爲 瞭解構造主義觀點的 數學家</p><p>腦子裏想的其實是一個不足掛齒的形式體系</p><p>或者 把構造主義與遞歸函數理論 混爲一談</p><p></p></p></li>

<li><p><p></p><p>布勞維爾 深陷 形而上學的空斷</p><p>只爲改進關於 連續統[continuum] 的理論</p><p>強行揣測 連續統的性質</p><p>成了布勞維爾和邏輯學家的魔怔</p><p></p></p><p></p><p><p></p><p>這引邏輯學家走向扭曲</p><p>發展各種形式體系</p><p>種種都脫離實際</p><p>你解釋我 我解釋你</p><p>寄希望於 連續統的性質 終有一天將自行顯現</p><p></p></p><p></p><p><p></p><p>這引起布勞維爾揮之不去的懷疑</p><p>除非他親自出馬加以阻止</p><p>否則 連續統 將變爲 離散的</p><p>他爲此引入了 自由選擇序列[free-choice sequences]</p><p>用以構造連續統</p><p>這樣 連續統 就不能是離散的了</p><p>只因定義上的差異</p><p>這使得數學變得非常怪異</p><p>變得不合數學家的胃口</p><p>這註定毀了布勞維爾的計劃</p><p>這很可惜</p><p>因爲對於古典數學的缺陷</p><p>布勞維爾有卓越的洞見</p><p>且他英雄壯舉 預要改正數學</p><p></p></p></li></ul>
</div>
</div>
