source/_posts/translation/a-constructivist-manifesto.org
*** 原文

    - Geometry was highly idealistic
        from the time of Euclid and the ancients
        until the time of Descartes,
      unfolding from axioms
      taken either to be self-evident
      or to reflect properties of the real world.

      Descartes reduced geometry to the theory of the real numbers,
      and in the nineteenth century
      Dedekind, Weierstrass, and others,
      by the arithmetization of the real number system,
      brought space into the concrete realm of objects
      constructed by pure thought.

    - Unfortunately
      the promise held out to mathematics
      by the arithmetization of space
      was not fulfilled,
      largely due to the intervention,
      around the turn of the century,
      of the formalist program.

      The successful formalization of mathematics
      helped keep mathematics on a wrong course.

      The fact that space has been arithmetized
      loses much of its significance
      if space, number, and everything else
      are fitted into a matrix of idealism
      where even the positive integers
      have an ambiguous computational existence.

      Mathematics becomes the game of sets,
      which is a fine game as far as it goes,
      with rules that are admirably precise.
      The game becomes its own justification,
      and the fact that it represents
      a highly idealized version of mathematical existence
      is universally ignored.

    - Of course, idealistic tendencies have been present
      if not dominantin mathematics
      since the Greeks,
      but it took the full flowering of formalism
      to kill the insight into the nature of mathematics
      which its arithmetization could have given.

    - To see how some of the most basic results of classical analysis
      lack computational meaning,
      take the assertion that
      - every bounded non-void set A of real numbers
        has a least upper bound.
        - The real number b is the least upper bound of A
          if a <= b
          for all a in A
          and if there exist elements of A
          that are arbitrarily close to b.

      To avoid unnecessary complications,
      we actually consider the somewhat less general assertion that
      - every bounded sequence {x(k)} of rational numbers
        has a least upper bound b
        (in the set of real numbers).

      If this assertion were constructively valid,
      we could compute b,
      in the sense of computing a rational number approximating b
      to within any desired accuracy;
      infact we could program a digital computer
      to compute the approximations for us.
      For instance,
      the computer could be programmed to produce, one by one,
      a sequence {(b(k), m(k))} of ordered pairs,
      where each b(k) is a rational number
      and each m(k) is a positive integer, such that
      1. x(j) <= b(k) + 1/k
         for all positive integers j and k,
      2. x(m(k)) >= b(k) - 1/k
         for all positive integers k.

      Unless there exists a general method M that
      produces such a computer program
      corresponding to each bounded
      constructively given sequence {x(k)} of rational numbers,
      we are not justified, by constructive standards,
      in asserting that each of the sequences {x(k)}
      has a least upper bound.

      To see the scope such a method M would have,
      consider a constructively given sequence {n(k)} of integers,
      each of which is either 0 or 1.
      Using the method M,
      we compute a rational number b(3)
      and a positive integer N = m(3) such that
      1. n(j) <= b(3) + 1/3
         for all positive integers j
      2. n(N) >= b(3) - 1/3

      Either n(N) = 0 or n(N) = 1
      If n(N) = 0
      then (1) and (2) imply that
        n(j) <= b(3) + 1/3 <= n(N) + 2/3 = 2/3
        for all j
      Since each n(j) is either 0 or 1,
      it follows that n(j) = 0, for all j.
      Thus,
      for each of the sequences {n(k)} being considered,
      the method M either
      1. produces a proof that
         the n(k) are all equal to 0,
      2. or produces a positive integer N
         such that n(N) = 1.
      Of course, such a method M does not exist,
      and nobody expects that one will ever be found.
      Such a method
      would solve most of the famous unsolved problems of mathematics
      Fermat's last theorem,
      the four-color problem,
      and the Riemann hypothesis, in particular,
      since each of these problems can be reduced to finding,
      for a certain sequence {n(k)} of the type being considered,
      either a proof that
        n(k) = 0 for all k
      or a proof that
        n(k) = 1 for some k.

    - As another instance,
      consider the intuitively appealing theorem that
      - every continuous function f on the closed interval [0,1],
        for which f(0) < 0 and f(1) > 0,
        vanishes at some point x0.

      This theorem can be derived from the least-upper-bound principle:
      take x0 to be the least upper bound
      of the set of all x for which f(x) < 0.

      The fact that we make use of the least-upper-bound principle
      does not mean our theorem is unconstructive;
      it only means the given proof is unconstructive.

      A closer examination demonstrates that
      our theorem itself is unconstructive.
      This demonstration, which we now give,
      uses facts from the constructive theory of continuous functions,
      with which the reader is probably not familiar.
      Nevertheless, it should provide some insight.
      Let {n(k)} be any constructively given sequence of integers,
      each of which is either -1, 0, or 1.
      Define the real number a by
        a = SUM 3^-k * n(k)
            where k from 1 to positive-infinity
      There exists a unique constructively given continuous
      function f on [0,1] such that
        f(0) = -1
        f(1) = 1
        f(1/3) = f(2/3) = a
      and f is linear on each of the intervals
        [0,1/3]
        [1/3,2/3]
        [2/3,1]
      If our theorem is valid,
      there exists a point x0 with f(x0) = 0.
        By computing a sufficiently close
        rational approximation to x0,
      we show that either
      1. x0 < 2/3
      2. x0 > 1/3
      In the first case, a >= 0,
      and therefore
      the first nonzero term of the sequence {n(k)},
      if one exists, equals 1.
      Similarly, in the second case,
      the first nonzero term,
      if one exists, equals -1.
      Thus our theorem gives a method,
      for each of the sequences {n(k)} being considered,
      of either
      1. proving that any term that equals 1
         is preceded by a term that equals -1,
      2. proving that any term that equals -1
         is preceded by a term that equals 1.
      Nobody believes that such a method will ever be found.

    - Brouwer fought the advance of formalism
      and undertook the disengagement of mathematics from logic.
      He wanted to strengthen mathematics by
        associating to every theorem and every proof
        a pragmatically meaningful interpretation.

      His program failed to gain support.

      He was an indifferent expositor and an inflexible advocate,
      contending against the great prestige of Hilbert
      and the undeniable fact that
      idealistic mathematics produced the most general results
      with the least effort.

      More important,
      Brouwer's system itself had traces of idealism
      and, worse, of metaphysical speculation.
      There was a preoccupation
      with the philosophical aspects of constructivism
      at the expense of concrete mathematical activity.

      A calculus of negation was developed
      which became a crutch
      to avoid the necessity of getting precise constructive results.
      It is not surprising that
      some of Brouwer's precepts were then formalized,
      giving rise to so-called intuitionistic number theory,
      and that the formal system so obtained
      turned out not to be of any constructive value.

      In fairness to Brouwer
      it should be said that
      he did not associate himself with these efforts
      to formalize reality;
      it is the fault of the logicians that
      many mathematicians who think they know something of the constructive point of view
      have in mind a dinky formal system
      or, just as bad,
      confuse constructivism with recursive function theory.

    - Brouwer became involved in metaphysical speculation
      by his desire to improve the theory of the continuum.
      A bugaboo of both Brouwer and the logicians
      has been compulsive speculation
      about the nature of the continuum.

      In the case of the logicians this leads to contortions
      in which various formal systems,
      all detached from reality,
      are interpreted within one another
      in the hope that
      the nature of the continuum will somehow emerge.

      In Brouwer's case
      there seems to have been a nagging suspicion that
      unless he personally intervened to prevent it
      the continuum would turn out to be discrete.
      He therefore introduced the method of free-choice sequences
      for constructing the continuum,
      as a consequence of which the continuum cannot be discrete
      because it is not well enough defined.
      This makes mathematics so bizarre
      it becomes unpalatable to mathematicians,
      and foredooms the whole of Brouwer's program.
      This is a pity,
      because Brouwer had a remarkable insight
      into the defects of classical mathematics,
      and he made a heroic attempt to set things right.

