translate/a-constructivist-manifesto.html

<div id="outline-container-org33425d9" class="outline-3">
<h3 id="org33425d9">原文</h3>
<div class="outline-text-3" id="text-org33425d9">
<ul class="org-ul">
<li><p><p></p><p>Geometry was highly idealistic</p><p>  from the time of Euclid and the ancients</p><p>  until the time of Descartes,</p><p>unfolding from axioms</p><p>taken either to be self-evident</p><p>or to reflect properties of the real world.</p><p></p></p><p></p><p><p></p><p>Descartes reduced geometry to the theory of the real numbers,</p><p>and in the nineteenth century</p><p>Dedekind, Weierstrass, and others,</p><p>by the arithmetization of the real number system,</p><p>brought space into the concrete realm of objects</p><p>constructed by pure thought.</p><p></p></p></li>

<li><p><p></p><p>Unfortunately</p><p>the promise held out to mathematics</p><p>by the arithmetization of space</p><p>was not fulfilled,</p><p>largely due to the intervention,</p><p>around the turn of the century,</p><p>of the formalist program.</p><p></p></p><p></p><p><p></p><p>The successful formalization of mathematics</p><p>helped keep mathematics on a wrong course.</p><p></p></p><p></p><p><p></p><p>The fact that space has been arithmetized</p><p>loses much of its significance</p><p>if space, number, and everything else</p><p>are fitted into a matrix of idealism</p><p>where even the positive integers</p><p>have an ambiguous computational existence.</p><p></p></p><p></p><p><p></p><p>Mathematics becomes the game of sets,</p><p>which is a fine game as far as it goes,</p><p>with rules that are admirably precise.</p><p>The game becomes its own justification,</p><p>and the fact that it represents</p><p>a highly idealized version of mathematical existence</p><p>is universally ignored.</p><p></p></p></li>

<li><p>Of course, idealistic tendencies have been present</p><p>if not dominantin mathematics</p><p>since the Greeks,</p><p>but it took the full flowering of formalism</p><p>to kill the insight into the nature of mathematics</p><p>which its arithmetization could have given.</p></li>

<li><p><p></p><p>To see how some of the most basic results of classical analysis</p><p>lack computational meaning,</p><p>take the assertion that</p><p></p></p><p><ul class="org-ul"></p><p><li><p>every bounded non-void set A of real numbers</p><p>has a least upper bound.</p><p><ul class="org-ul"></p><p><li><p>The real number b is the least upper bound of A</p><p>if a &lt;= b</p><p>for all a in A</p><p>and if there exist elements of A</p><p>that are arbitrarily close to b.</p></li></ul></p></li></ul></p><p><p></p><p>To avoid unnecessary complications,</p><p>we actually consider the somewhat less general assertion that</p><p></p></p><p><ul class="org-ul"></p><p><li><p>every bounded sequence {x(k)} of rational numbers</p><p>has a least upper bound b</p><p>(in the set of real numbers).</p></li></ul></p><p><p></p><p>If this assertion were constructively valid,</p><p>we could compute b,</p><p>in the sense of computing a rational number approximating b</p><p>to within any desired accuracy;</p><p>infact we could program a digital computer</p><p>to compute the approximations for us.</p><p>For instance,</p><p>the computer could be programmed to produce, one by one,</p><p>a sequence {(b(k), m(k))} of ordered pairs,</p><p>where each b(k) is a rational number</p><p>and each m(k) is a positive integer, such that</p><p></p></p><p><ol class="org-ol"></p><p><li>x(j) &lt;= b(k) + 1/k</p><p>for all positive integers j and k,</li></p><p><li>x(m(k)) &gt;= b(k) - 1/k</p><p>for all positive integers k.</li></ol></p><p><p></p><p>Unless there exists a general method M that</p><p>produces such a computer program</p><p>corresponding to each bounded</p><p>constructively given sequence {x(k)} of rational numbers,</p><p>we are not justified, by constructive standards,</p><p>in asserting that each of the sequences {x(k)}</p><p>has a least upper bound.</p><p></p></p><p></p><p><p></p><p>To see the scope such a method M would have,</p><p>consider a constructively given sequence {n(k)} of integers,</p><p>each of which is either 0 or 1.</p><p>Using the method M,</p><p>we compute a rational number b(3)</p><p>and a positive integer N = m(3) such that</p><p></p></p><p><ol class="org-ol"></p><p><li>n(j) &lt;= b(3) + 1/3</p><p>for all positive integers j</li></p><p><li>n(N) &gt;= b(3) - 1/3</li></ol></p><p><p></p><p>Either n(N) = 0 or n(N) = 1</p><p>If n(N) = 0</p><p>then (1) and (2) imply that</p><p>  n(j) &lt;= b(3) + 1/3 &lt;= n(N) + 2/3 = 2/3</p><p>  for all j</p><p>Since each n(j) is either 0 or 1,</p><p>it follows that n(j) = 0, for all j.</p><p>Thus,</p><p>for each of the sequences {n(k)} being considered,</p><p>the method M either</p><p></p></p><p><ol class="org-ol"></p><p><li>produces a proof that</p><p>the n(k) are all equal to 0,</li></p><p><li>or produces a positive integer N</p><p>such that n(N) = 1.</li></ol></p><p><p></p><p>Of course, such a method M does not exist,</p><p>and nobody expects that one will ever be found.</p><p>Such a method</p><p>would solve most of the famous unsolved problems of mathematics</p><p>Fermat's last theorem,</p><p>the four-color problem,</p><p>and the Riemann hypothesis, in particular,</p><p>since each of these problems can be reduced to finding,</p><p>for a certain sequence {n(k)} of the type being considered,</p><p>either a proof that</p><p>  n(k) = 0 for all k</p><p>or a proof that</p><p>  n(k) = 1 for some k.</p><p></p></p></li>

<li><p><p></p><p>As another instance,</p><p>consider the intuitively appealing theorem that</p><p></p></p><p><ul class="org-ul"></p><p><li><p>every continuous function f on the closed interval [0,1],</p><p>for which f(0) &lt; 0 and f(1) &gt; 0,</p><p>vanishes at some point x0.</p></li></ul></p><p><p></p><p>This theorem can be derived from the least-upper-bound principle:</p><p>take x0 to be the least upper bound</p><p>of the set of all x for which f(x) &lt; 0.</p><p></p></p><p></p><p><p></p><p>The fact that we make use of the least-upper-bound principle</p><p>does not mean our theorem is unconstructive;</p><p>it only means the given proof is unconstructive.</p><p></p></p><p></p><p><p></p><p>A closer examination demonstrates that</p><p>our theorem itself is unconstructive.</p><p>This demonstration, which we now give,</p><p>uses facts from the constructive theory of continuous functions,</p><p>with which the reader is probably not familiar.</p><p>Nevertheless, it should provide some insight.</p><p>Let {n(k)} be any constructively given sequence of integers,</p><p>each of which is either -1, 0, or 1.</p><p>Define the real number a by</p><p>  a = SUM 3<sup>-k</sup> * n(k)</p><p>      where k from 1 to positive-infinity</p><p>There exists a unique constructively given continuous</p><p>function f on [0,1] such that</p><p>  f(0) = -1</p><p>  f(1) = 1</p><p>  f(1/3) = f(2/3) = a</p><p>and f is linear on each of the intervals</p><p>  [0,1/3]</p><p>  [1/3,2/3]</p><p>  [2/3,1]</p><p>If our theorem is valid,</p><p>there exists a point x0 with f(x0) = 0.</p><p>  By computing a sufficiently close</p><p>  rational approximation to x0,</p><p>we show that either</p><p></p></p><p><ol class="org-ol"></p><p><li>x0 &lt; 2/3</li></p><p><li>x0 &gt; 1/3</li></ol></p><p><p></p><p>In the first case, a &gt;= 0,</p><p>and therefore</p><p>the first nonzero term of the sequence {n(k)},</p><p>if one exists, equals 1.</p><p>Similarly, in the second case,</p><p>the first nonzero term,</p><p>if one exists, equals -1.</p><p>Thus our theorem gives a method,</p><p>for each of the sequences {n(k)} being considered,</p><p>of either</p><p></p></p><p><ol class="org-ol"></p><p><li>proving that any term that equals 1</p><p>is preceded by a term that equals -1,</li></p><p><li>proving that any term that equals -1</p><p>is preceded by a term that equals 1.</li></ol></p><p><p></p><p>Nobody believes that such a method will ever be found.</p><p></p></p></li>

<li><p><p></p><p>Brouwer fought the advance of formalism</p><p>and undertook the disengagement of mathematics from logic.</p><p>He wanted to strengthen mathematics by</p><p>  associating to every theorem and every proof</p><p>  a pragmatically meaningful interpretation.</p><p></p></p><p></p><p><p></p><p>His program failed to gain support.</p><p></p></p><p></p><p><p></p><p>He was an indifferent expositor and an inflexible advocate,</p><p>contending against the great prestige of Hilbert</p><p>and the undeniable fact that</p><p>idealistic mathematics produced the most general results</p><p>with the least effort.</p><p></p></p><p></p><p><p></p><p>More important,</p><p>Brouwer's system itself had traces of idealism</p><p>and, worse, of metaphysical speculation.</p><p>There was a preoccupation</p><p>with the philosophical aspects of constructivism</p><p>at the expense of concrete mathematical activity.</p><p></p></p><p></p><p><p></p><p>A calculus of negation was developed</p><p>which became a crutch</p><p>to avoid the necessity of getting precise constructive results.</p><p>It is not surprising that</p><p>some of Brouwer's precepts were then formalized,</p><p>giving rise to so-called intuitionistic number theory,</p><p>and that the formal system so obtained</p><p>turned out not to be of any constructive value.</p><p></p></p><p></p><p><p></p><p>In fairness to Brouwer</p><p>it should be said that</p><p>he did not associate himself with these efforts</p><p>to formalize reality;</p><p>it is the fault of the logicians that</p><p>many mathematicians who think they know something of the constructive point of view</p><p>have in mind a dinky formal system</p><p>or, just as bad,</p><p>confuse constructivism with recursive function theory.</p><p></p></p></li>

<li><p><p></p><p>Brouwer became involved in metaphysical speculation</p><p>by his desire to improve the theory of the continuum.</p><p>A bugaboo of both Brouwer and the logicians</p><p>has been compulsive speculation</p><p>about the nature of the continuum.</p><p></p></p><p></p><p><p></p><p>In the case of the logicians this leads to contortions</p><p>in which various formal systems,</p><p>all detached from reality,</p><p>are interpreted within one another</p><p>in the hope that</p><p>the nature of the continuum will somehow emerge.</p><p></p></p><p></p><p><p></p><p>In Brouwer's case</p><p>there seems to have been a nagging suspicion that</p><p>unless he personally intervened to prevent it</p><p>the continuum would turn out to be discrete.</p><p>He therefore introduced the method of free-choice sequences</p><p>for constructing the continuum,</p><p>as a consequence of which the continuum cannot be discrete</p><p>because it is not well enough defined.</p><p>This makes mathematics so bizarre</p><p>it becomes unpalatable to mathematicians,</p><p>and foredooms the whole of Brouwer's program.</p><p>This is a pity,</p><p>because Brouwer had a remarkable insight</p><p>into the defects of classical mathematics,</p><p>and he made a heroic attempt to set things right.</p><p></p></p></li></ul>
</div>
</div>
</div>
