source/_posts/translation/a-constructivist-manifesto.org
* 構造 / the constructivization of mathematics

*** 譯文

    - 一個集合定義於
      描述如何構造其元素
      描述如何判斷二元素相等

      並沒有保證說這種描述一定能被理解
      可能 作者認爲已經把集合描述清楚了
      而 讀者卻沒有頭緒

      比如
      考慮整數序列 {n(k)}
      爲了構造這樣一個序列
      我們需要
      1. 給出一個計算規則
         使得對於 任意 正整數 k
         都能算得 一個 整數 n(k)
      2. 並且每次的計算
         都能在有限步驟內結束

      那好 整數序列 {n(k)} 也可以解釋爲
      1. 搜索 並 辨認以接受
      2. 並證明在有限步驟內
         搜索可以找到一個可以接受的 n(k)

      [我不確定 搜索 一詞 對 Bishop 意謂着什麼
       我想 搜索 代表了 隨機性
       我可以嘗試給一個例子 來補充 Bishop 這裏的論點
       設想
       一個小小納米機器人在某個分子世界中隨機行走
       每當它走累了就停下裏歇息
       並記錄身邊的一個分子中原子的個數 做爲 n(k)
       我瞭解這個小機器人 知道它走一會就得歇息一會
       有限步驟內一定能找到 n(k)
       這裏蘊含的隨機性
       已經使得 所生成的數列 不是傳統的函數了
       總之 能體會到上下兩種最整數序列的定義
       其性質是完全不同的 就好]

      當然 我們想的並不是這樣的定義
      但是 我們不可能考慮到
      對我們所下的定義的 所有可能的解釋
      並說出 各種解釋符不合符合我們的心意

      定義總會有歧義
      但是 隨着讀者閱讀
      歧義會減少
      作者的意圖會被一點一點發現
      隨着 閱讀深入 思維展開
      讀者需要修改自己解釋
      來迎合作者的意圖

      在交流的過程中
      只要對與作者目前所說的 有個合理的解釋
      讀者就應該滿足了

      而作者本身
      不可能全然知曉 他下的定義 所能衍生出來的所有解釋
      且 他也有必要修改自己的解釋
      有時 連定義本身也要修改
      順應經驗使然

    - 構造主義 對 數學連詞 與 數學量詞 的
      [Bishop 故意不說 邏輯連詞 與 邏輯量詞]
      由布勞維爾建立

    - 爲證 (P 且 Q)
      需 證 P
      且 證 Q
      這與古典數學相同

    - 爲證 (P 或 Q)
      需 證 P
      或 證 Q
      而在古典數學中 爲證 (P 或 Q) 可以根被不必證明 P Q 之一

    - 爲證 (P 則 Q)
      需證 P 可證 則 Q 可證
      [我們也記之爲
       (P -> Q)
       (若 P 則 Q)
       (P 推出 Q)
       (P 蘊含 Q)]

      [這類式子 我稱之爲 則式
       則 字 譯自 imply
       通常譯之爲 蘊含
       Bishop 對 則式 的理解曖昧不明
       故不良之句 去而不譯
       我同時也
       譯 瑾欽[Gentzen]的 sequent calculus 爲 則式演算
       並譯 sequent 爲 則式
       對與 則式 的討論
       詳見 程序語言蟬語的文檔]

    - 爲證 (否 P)
      需正 (P 則 0 = 1)
      或者 (P 則 其他顯然的矛盾)
      [也就是說 否定被細化爲了各種各樣的矛盾]
      古典數學不區分 P 與 (not (not P))
      而對於構造主義來說
      二者顯然有別 後者弱 而前者強

    - 布勞維爾的體系中
      否定在定義中得以重用
      例如 不等 和 補集
      根據布勞維爾
      集合 A 的兩個元素不等
      若 這元素之相等 能讓我們算出 0 = 1

      自然想換 消極的定義 成 積極的定義
      在定義中 儘量多說一些 計算有關的信息
      詳細地
      用 什麼樣的計算 產生 什麼樣的結果
      來做定義

      布勞維爾本人 對於實數系統就是這麼做的
      對於不等關係 給以了更強的積極定義
      以補之前充消極的定義
      經驗表明
      根本沒必要用否定來定義不等關係
      需要不等關係的地方 最好以積極的方式引入它們
      對於 補集 也是如此

    - Van Dantzig 和 其他人 更認爲
      可以完全 去除構造主義數學中的 否定
      經驗證實了這一點
      在很多地方 我們看似在用否定
      比如
        一個整數 要麼爲偶數 要麼不爲偶數
      我們實際是說 有限的兩種選擇中的一個

      爲了不那麼教條
      我們在這類情形下還是使用根 否定 有關的說法
      但僅僅把這種說法限制在這種有限的情況下
      直到經驗讓我們改了主意
      直到反例給我們了新的動機

      這樣的好處是把數學變得更直接
      並且
      在某些情況下
      鼓勵我們琢磨我們的結論

    - 反證法 [歸謬法]
      [這裏我完全拋棄 Bishop 的句子
       自己重新敘述]

      [反證法 在於
       爲否定某個命題
       先假設其正確
       再推出矛盾
       此方法在構造主義數學中的合法性是顯然的
       因爲
       我們定義 (否 P) 的方式
       就是 (P 則 某個矛盾)
       比如上面我們對 任意有界實數集有最小上界 這個命題的否定
       就在於 證明
       (若 任意有界實數集有最小上界
        則 我們能找到萬能程序生成器 M
           這個 M 可以用來生成各種數學難題的證明)]

    - 任意量詞
      即 任意 A 之元素 有性質 P
      [記爲 (x : A 則 P(x))
       或 (x : A -> P(x))]
      在構造主義數學中的意思與古典數學一樣
      爲了證明這種命題
      需證
      若 x 爲 A 的元素
      則 x 有性質 P

    - 存在量詞
      構造主義數學中 存在量詞
      要比 古典數學中 侷限得多

      證明一個東西存在的唯一方式
      就是找出它
      或構造它
      或寫一個在有限步驟內結束的程序算出它
      然而
      在古典數學中
      有別的手段可以用來證明 存在性

      如下原則在古典數學中有效
        要麼 任意 A 的元素 有性質 P
        要麼 存在 A 的某個元素 有性質 (否 P)
      這個原則
      我們稱之爲 無所不知原則[the principle of omniscience]
      是古典數學中 大多數不具有構造性的結果 的根源
      看 無所不知原則的簡化版本 就知道了
        若 {n(k)} 是整數數列
        則 要麼 n(k) = 0 對某些 k 成立
           要麼 n(k) =/= 0 對所有 k 成立
      我們稱之爲 受限無所不知原則[the limited principle of omniscience]
      古典數學中的 一個接一個的定理
      都本質上依賴 受限無所不知原則
      因此 他們的證明 是不具有構造性的

      例如
      - 閉區間上 連續實值函數 達到其最大值
      - 封閉單元上 連續變換 具有不動點 [即 不動點定理]
      - 遍歷定理[ergodictheorem]
      - 哈恩-巴拿赫定理[Hahn-Banach theorem]

      然而
      構造主義數學 並不是把這些定理拋棄了
      這裏列出的每個定理 P
      都有一個構造主義代替 Q
      Q 是具有構造意義的
      在古典數學中 Q 蘊含 P
      [即 Q 強與 P]
      例如
        封閉單元上 連續變換 具有不動點
      其構造主義代替爲
        封閉單元上 連續變換
        可找一點
        其像與其任意接近

    - 古典數學中的定理
      在多大程度上 有良好的構造主義代替
      展示了
      古典數學具有堅實的構造主義基礎

    - 當一個古典數學家聲明自己是個構造主義者時
      他可能指 他不使用 選擇公理
      這個公理是少有的 能折磨古典數學家良心的了
      但是 實際上這個公理 並不是古典數學非構造性的根源
      選擇函數 在構造主義數學中是存在的
      因爲
      選擇 蘊於 存在之本
      [a choice is implied by the very meaning of existence]

      古典數學中 使用選擇公理時
      要麼 是無關緊要的
      要麼 就混用了 無所不知原則
      選擇公理被用以從等價類中選取元素
      然而 等價類一開始就不應該出現
      例如
      實數 不應該被定義爲
      柯西列[Cauchy sequences] 的等價類
      等價類 之引入 實屬無益
      又例如
      實數集是良序的[the real numbers can be well ordered]
      其證明 就混用了 選擇公理 和 無所不知原則
      這種證明獲得構造意義的希望渺茫
        實數集是良序的
      這個定理想要獲得
      與古典解釋的直覺意義 相互協調的 構造主義版本
      看來是不可能了

    - 幾乎所有能想到的抵抗都試過了
      想要抵抗這種 現實主義的 簡單處理數學 的方式

      布勞維爾 所做的構造主義數學比任何人都多
      但是 他卻認爲
      需要爲 連續統 引入一種 革命性的 半神祕的理論

      外爾[Weyl] 偉大的數學家
      在實踐中壓制着自己對構造主義的信仰
      但是 他卻說過
      理想主義數學應用於物理學
      在這種應用中 找的到理想主義數學的合理性

      希爾伯特 在其所提出的 元數學[meta-mathematics] 中
      堅持使用 構造主義方法
      但是 他卻相信
      構造主義數學的代價太大
      只要在元數學內證明形式體系的一致性[consistency]
      他就滿足了
      [即 著名的 希爾伯特計劃]

      另外還有些人 想要在遞歸函數理論中 尋找構造主義的真諦
      [指 蘇俄的學派]

      人們仍然尋求着通向現實的捷徑
      好想找到去桃花源的路
      豁然開朗 讓人洞觀所有古典數學的構造意義
      人們忙於找捷徑 但都以失敗告終
      毫不誇張地說
      坦途大路還沒人走過呢
      現實主義的 簡單處理數學 的方式
      還有待嘗試呢
      現在 是時候做這樣的嘗試了

