translate/a-constructivist-manifesto.html

<div id="outline-container-org44c0d73" class="outline-2">
<h2 id="org44c0d73">構造 / the constructivization of mathematics</h2>
<div class="outline-text-2" id="text-org44c0d73">
</div><div id="outline-container-orgedaeebe" class="outline-3">
<h3 id="orgedaeebe">譯文</h3>
<div class="outline-text-3" id="text-orgedaeebe">
<ul class="org-ul">
<li><p><p></p><p>一個集合定義於</p><p>描述如何構造其元素</p><p>描述如何判斷二元素相等</p><p></p></p><p></p><p><p></p><p>並沒有保證說這種描述一定能被理解</p><p>可能 作者認爲已經把集合描述清楚了</p><p>而 讀者卻沒有頭緒</p><p></p></p><p></p><p><p></p><p>比如</p><p>考慮整數序列 {n(k)}</p><p>爲了構造這樣一個序列</p><p>我們需要</p><p></p></p><p><ol class="org-ol"></p><p><li>給出一個計算規則</p><p>使得對於 任意 正整數 k</p><p>都能算得 一個 整數 n(k)</li></p><p><li>並且每次的計算</p><p>都能在有限步驟內結束</li></ol></p><p><p></p><p>那好 整數序列 {n(k)} 也可以解釋爲</p><p></p></p><p><ol class="org-ol"></p><p><li>搜索 並 辨認以接受</li></p><p><li>並證明在有限步驟內</p><p>搜索可以找到一個可以接受的 n(k)</li></ol></p><p><p></p><p>[我不確定 搜索 一詞 對 Bishop 意謂着什麼</p><p> 我想 搜索 代表了 隨機性</p><p> 我可以嘗試給一個例子 來補充 Bishop 這裏的論點</p><p> 設想</p><p> 一個小小納米機器人在某個分子世界中隨機行走</p><p> 每當它走累了就停下裏歇息</p><p> 並記錄身邊的一個分子中原子的個數 做爲 n(k)</p><p> 我瞭解這個小機器人 知道它走一會就得歇息一會</p><p> 有限步驟內一定能找到 n(k)</p><p> 這裏蘊含的隨機性</p><p> 已經使得 所生成的數列 不是傳統的函數了</p><p> 總之 能體會到上下兩種最整數序列的定義</p><p> 其性質是完全不同的 就好]</p><p></p></p><p></p><p><p></p><p>當然 我們想的並不是這樣的定義</p><p>但是 我們不可能考慮到</p><p>對我們所下的定義的 所有可能的解釋</p><p>並說出 各種解釋符不合符合我們的心意</p><p></p></p><p></p><p><p></p><p>定義總會有歧義</p><p>但是 隨着讀者閱讀</p><p>歧義會減少</p><p>作者的意圖會被一點一點發現</p><p>隨着 閱讀深入 思維展開</p><p>讀者需要修改自己解釋</p><p>來迎合作者的意圖</p><p></p></p><p></p><p><p></p><p>在交流的過程中</p><p>只要對與作者目前所說的 有個合理的解釋</p><p>讀者就應該滿足了</p><p></p></p><p></p><p><p></p><p>而作者本身</p><p>不可能全然知曉 他下的定義 所能衍生出來的所有解釋</p><p>且 他也有必要修改自己的解釋</p><p>有時 連定義本身也要修改</p><p>順應經驗使然</p><p></p></p></li>

<li><p>構造主義 對 數學連詞 與 數學量詞 的</p><p>[Bishop 故意不說 邏輯連詞 與 邏輯量詞]</p><p>由布勞維爾建立</p></li>

<li><p>爲證 (P 且 Q)</p><p>需 證 P</p><p>且 證 Q</p><p>這與古典數學相同</p></li>

<li><p>爲證 (P 或 Q)</p><p>需 證 P</p><p>或 證 Q</p><p>而在古典數學中 爲證 (P 或 Q) 可以根被不必證明 P Q 之一</p></li>

<li><p><p></p><p>爲證 (P 則 Q)</p><p>需證 P 可證 則 Q 可證</p><p>[我們也記之爲</p><p> (P -&gt; Q)</p><p> (若 P 則 Q)</p><p> (P 推出 Q)</p><p> (P 蘊含 Q)]</p><p></p></p><p></p><p><p></p><p>[這類式子 我稱之爲 則式</p><p> 則 字 譯自 imply</p><p> 通常譯之爲 蘊含</p><p> Bishop 對 則式 的理解曖昧不明</p><p> 故不良之句 去而不譯</p><p> 我同時也</p><p> 譯 瑾欽[Gentzen]的 sequent calculus 爲 則式演算</p><p> 並譯 sequent 爲 則式</p><p> 對與 則式 的討論</p><p> 詳見 程序語言蟬語的文檔]</p><p></p></p></li>

<li><p>爲證 (否 P)</p><p>需正 (P 則 0 = 1)</p><p>或者 (P 則 其他顯然的矛盾)</p><p>[也就是說 否定被細化爲了各種各樣的矛盾]</p><p>古典數學不區分 P 與 (not (not P))</p><p>而對於構造主義來說</p><p>二者顯然有別 後者弱 而前者強</p></li>

<li><p><p></p><p>布勞維爾的體系中</p><p>否定在定義中得以重用</p><p>例如 不等 和 補集</p><p>根據布勞維爾</p><p>集合 A 的兩個元素不等</p><p>若 這元素之相等 能讓我們算出 0 = 1</p><p></p></p><p></p><p><p></p><p>自然想換 消極的定義 成 積極的定義</p><p>在定義中 儘量多說一些 計算有關的信息</p><p>詳細地</p><p>用 什麼樣的計算 產生 什麼樣的結果</p><p>來做定義</p><p></p></p><p></p><p><p></p><p>布勞維爾本人 對於實數系統就是這麼做的</p><p>對於不等關係 給以了更強的積極定義</p><p>以補之前充消極的定義</p><p>經驗表明</p><p>根本沒必要用否定來定義不等關係</p><p>需要不等關係的地方 最好以積極的方式引入它們</p><p>對於 補集 也是如此</p><p></p></p></li>

<li><p><p></p><p>Van Dantzig 和 其他人 更認爲</p><p>可以完全 去除構造主義數學中的 否定</p><p>經驗證實了這一點</p><p>在很多地方 我們看似在用否定</p><p>比如</p><p>  一個整數 要麼爲偶數 要麼不爲偶數</p><p>我們實際是說 有限的兩種選擇中的一個</p><p></p></p><p></p><p><p></p><p>爲了不那麼教條</p><p>我們在這類情形下還是使用根 否定 有關的說法</p><p>但僅僅把這種說法限制在這種有限的情況下</p><p>直到經驗讓我們改了主意</p><p>直到反例給我們了新的動機</p><p></p></p><p></p><p><p></p><p>這樣的好處是把數學變得更直接</p><p>並且</p><p>在某些情況下</p><p>鼓勵我們琢磨我們的結論</p><p></p></p></li>

<li><p><p></p><p>反證法 [歸謬法]</p><p>[這裏我完全拋棄 Bishop 的句子</p><p> 自己重新敘述]</p><p></p></p><p></p><p><p></p><p>[反證法 在於</p><p> 爲否定某個命題</p><p> 先假設其正確</p><p> 再推出矛盾</p><p> 此方法在構造主義數學中的合法性是顯然的</p><p> 因爲</p><p> 我們定義 (否 P) 的方式</p><p> 就是 (P 則 某個矛盾)</p><p> 比如上面我們對 任意有界實數集有最小上界 這個命題的否定</p><p> 就在於 證明</p><p> (若 任意有界實數集有最小上界</p><p>  則 我們能找到萬能程序生成器 M</p><p>     這個 M 可以用來生成各種數學難題的證明)]</p><p></p></p></li>

<li><p>任意量詞</p><p>即 任意 A 之元素 有性質 P</p><p>[記爲 (x : A 則 P(x))</p><p> 或 (x : A -&gt; P(x))]</p><p>在構造主義數學中的意思與古典數學一樣</p><p>爲了證明這種命題</p><p>需證</p><p>若 x 爲 A 的元素</p><p>則 x 有性質 P</p></li>

<li><p><p></p><p>存在量詞</p><p>構造主義數學中 存在量詞</p><p>要比 古典數學中 侷限得多</p><p></p></p><p></p><p><p></p><p>證明一個東西存在的唯一方式</p><p>就是找出它</p><p>或構造它</p><p>或寫一個在有限步驟內結束的程序算出它</p><p>然而</p><p>在古典數學中</p><p>有別的手段可以用來證明 存在性</p><p></p></p><p></p><p><p></p><p> 如下原則在古典數學中有效</p><p>   要麼 任意 A 的元素 有性質 P</p><p>   要麼 存在 A 的某個元素 有性質 (否 P)</p><p>這個原則</p><p>我們稱之爲 無所不知原則[the principle of omniscience]</p><p>是古典數學中 大多數不具有構造性的結果 的根源</p><p>看 無所不知原則的簡化版本 就知道了</p><p>  若 {n(k)} 是整數數列</p><p>  則 要麼 n(k) = 0 對某些 k 成立</p><p>     要麼 n(k) <code>/</code> 0 對所有 k 成立</p><p>我們稱之爲 受限無所不知原則[the limited principle of omniscience]</p><p>古典數學中的 一個接一個的定理</p><p>都本質上依賴 受限無所不知原則</p><p>因此 他們的證明 是不具有構造性的</p><p></p></p><p></p><p><p></p><p>例如</p><p></p></p><p><ul class="org-ul"></p><p><li><p>閉區間上 連續實值函數 達到其最大值</p></li></p><p><li><p>封閉單元上 連續變換 具有不動點 [即 不動點定理]</p></li></p><p><li><p>遍歷定理[ergodictheorem]</p></li></p><p><li><p>哈恩-巴拿赫定理[Hahn-Banach theorem]</p></li></ul></p><p><p></p><p>然而</p><p>構造主義數學 並不是把這些定理拋棄了</p><p>這裏列出的每個定理 P</p><p>都有一個構造主義代替 Q</p><p>Q 是具有構造意義的</p><p>在古典數學中 Q 蘊含 P</p><p>[即 Q 強與 P]</p><p>例如</p><p>  封閉單元上 連續變換 具有不動點</p><p>其構造主義代替爲</p><p>  封閉單元上 連續變換</p><p>  可找一點</p><p>  其像與其任意接近</p><p></p></p></li>

<li><p>古典數學中的定理</p><p>在多大程度上 有良好的構造主義代替</p><p>展示了</p><p>古典數學具有堅實的構造主義基礎</p></li>

<li><p><p></p><p>當一個古典數學家聲明自己是個構造主義者時</p><p>他可能指 他不使用 選擇公理</p><p>這個公理是少有的 能折磨古典數學家良心的了</p><p>但是 實際上這個公理 並不是古典數學非構造性的根源</p><p>選擇函數 在構造主義數學中是存在的</p><p>因爲</p><p>選擇 蘊於 存在之本</p><p>[a choice is implied by the very meaning of existence]</p><p></p></p><p></p><p><p></p><p>古典數學中 使用選擇公理時</p><p>要麼 是無關緊要的</p><p>要麼 就混用了 無所不知原則</p><p>選擇公理被用以從等價類中選取元素</p><p>然而 等價類一開始就不應該出現</p><p>例如</p><p>實數 不應該被定義爲</p><p>柯西列[Cauchy sequences] 的等價類</p><p>等價類 之引入 實屬無益</p><p>又例如</p><p>實數集是良序的[the real numbers can be well ordered]</p><p>其證明 就混用了 選擇公理 和 無所不知原則</p><p>這種證明獲得構造意義的希望渺茫</p><p>  實數集是良序的</p><p>這個定理想要獲得</p><p>與古典解釋的直覺意義 相互協調的 構造主義版本</p><p>看來是不可能了</p><p></p></p></li>

<li><p><p></p><p>幾乎所有能想到的抵抗都試過了</p><p>想要抵抗這種 現實主義的 簡單處理數學 的方式</p><p></p></p><p></p><p><p></p><p>布勞維爾 所做的構造主義數學比任何人都多</p><p>但是 他卻認爲</p><p>需要爲 連續統 引入一種 革命性的 半神祕的理論</p><p></p></p><p></p><p><p></p><p>外爾[Weyl] 偉大的數學家</p><p>在實踐中壓制着自己對構造主義的信仰</p><p>但是 他卻說過</p><p>理想主義數學應用於物理學</p><p>在這種應用中 找的到理想主義數學的合理性</p><p></p></p><p></p><p><p></p><p>希爾伯特 在其所提出的 元數學[meta-mathematics] 中</p><p>堅持使用 構造主義方法</p><p>但是 他卻相信</p><p>構造主義數學的代價太大</p><p>只要在元數學內證明形式體系的一致性[consistency]</p><p>他就滿足了</p><p>[即 著名的 希爾伯特計劃]</p><p></p></p><p></p><p><p></p><p>另外還有些人 想要在遞歸函數理論中 尋找構造主義的真諦</p><p>[指 蘇俄的學派]</p><p></p></p><p></p><p><p></p><p>人們仍然尋求着通向現實的捷徑</p><p>好想找到去桃花源的路</p><p>豁然開朗 讓人洞觀所有古典數學的構造意義</p><p>人們忙於找捷徑 但都以失敗告終</p><p>毫不誇張地說</p><p>坦途大路還沒人走過呢</p><p>現實主義的 簡單處理數學 的方式</p><p>還有待嘗試呢</p><p>現在 是時候做這樣的嘗試了</p><p></p></p></li></ul>
</div>
</div>
