source/_posts/translation/a-constructivist-manifesto.org
*** 原文

    - A set is defined
      by describing exactly what must be done
      in order to construct an element of the set
      and what must be done in order to show that
      two elements are equal.

      There is no guarantee that
      the description will be understood;
      it may be that
      an author thinks he has described a set with sufficient clarity
      but a reader does not understand.

      As an illustration
      consider the set of all sequences {n(k)} of integers.
      To construct such a sequence
      we must give a rule
      which associates an integer n(k)
      to each positive integer k in such a way that
      for each value of k
      the associated integer n(k) can be determined
        in a finite number of steps
        by an entirely routine process.

      Now this definition could perhaps be interpreted
      to admit sequences {n(k)}
      in which n(k) is constructed by a search,
      the proof that the search actually produces a value of n(k)
      after a finite number of steps
      being given in some formal system.

      Of course, we do not have this interpretation in mind,
      but it is impossible
      to consider every possible interpretation of our definition
      and say whether that is what we have in mind.

      There is always ambiguity,
      but it becomes less and less as the reader continues to read
      and discovers more and more of the author's intent,
      modifying his interpretations if necessary
      to fit the intentions of the author
      as they continue to unfold.

      At any stage of the exposition
      the reader should be content
      if he can give a reasonable interpretation
      to account for everything the author has said.

      The expositor himself
      can never fully know all the possible ramifications of his definitions,
      and he is subject to the same necessity of modifying his interpretations,
      and sometimes his definitions as well,
      to conform to the dictates of experience.

    - The constructive interpretations
      of the mathematical connectives and quantifiers
      have been established by Brouwer.

    - To prove the statement (P and Q)
      we must prove the statement P and prove the statement Q,
      just as in classical mathematics.

    - To provethe statement (P or Q)
      we must either prove the statement P or prove the statement Q,
      whereas in classical mathematics
      it is possible to prove (P or Q) without proving either the statement P or the statement Q.

    - The connective 'implies' is more complicated.
      To prove (P implies Q)
      we must show that P necessarily entails Q,
      or that Q is true whenever P is true.
      The validity of the computational facts implicit in the statement P
      must insure the validity of the computational facts implicitin the statement Q,
      but the way this actually happens can only be seen
      by looking at the proof of the statement (P implies Q).
      Statements formed with this connective,
      for example, statements of the type ((P implies Q) implies R),
      have a less immediate meaning than the statements from which they are formed,
      although in actual practice
      this does not seem to lead to difficulties in interpretation.

    - The negation (not P) of a statement P
      is the statement (P implies 0 = 1).
      Classical mathematics makes no distinction
      between the content of the statements P and not (not P),
      whereas constructively
      the latter is a weaker statement.

    - Brouwer's system makes essential use of negation in defining,
      for instance, inequality and set complementation.
      Thus two elements of a set A are unequal
        according to Brouwer
      if the assumption of their equality
      somehow allows us to compute that 0 = 1.

      It is natural to want to replace this negativistic definition
      by something more affirmative,
      phrased as much as possible
      in terms of specific computations
      leading to specific results.

      Brouwer himself does just this for the real number system,
      introducing an affirmative and stronger relation of inequality
      in addition to the negativistic relation already defined.
      Experience shows that it is not necessary to define inequality in terms of negation.
      For those cases in which an inequality relation is needed,
      it is better to introduce it affirmatively.
      The same remarks apply to set complementation.

    - Van Dantzig and others have gone as far as to propose that
      negation could be entirely avoided in constructive mathematics.
      Experience bears this out.
      In many cases where we seem to be using negation
      for instance, in the assertion that
        either a given integer is even or it is no
      we are really asserting that
      one of two finitely distinguishable alternatives actually obtains.

      Without intending to establish a dogma,
      we may continue to employ the language of negation
      but reserve it for situations of this sort,
      at least until experience changes our minds,
      and for counterexamples and purposes of motivation.

      This will have the advantage of making mathematics more immediate
      and in certain situations forcing us to sharpen our results.

    - Proofs by contradiction
      are constructively justified in finite situations.

      When we have proved that
      one of finitely many alternatives holds at a certain stage in the proof of a theorem,
      to finish the proof of the theorem it is enough to show that
      the theorem is a consequence of each of the alternatives.
      Should one of the alternatives lead to a contradiction,
      that is, imply 0 = 1,
      we may either say that the alternative in question is ruled out
      and pass on to the consideration of the other alternatives,
      or we may be more meticulous
      and prove that the theorem is a consequence of the equality 0 = 1.

    - A universal statement,
      to the effect that
      every element of a certain set A has a certain property P,
      has the same meaning in constructive as in classical mathematics.
      To prove such a statement
      we must show by some general argument that
      if x is any element of A,
      then x has property P.

    - Constructive existence
      is much more restrictive
      than the ideal existence of classical mathematics.

      The only way to show that an object exists
      is to give a finite routine for finding it,
      whereas in classical mathematics
      other methods can be used.
      In fact the following principle is valid in classical mathematics:
        Either all elements of A have property P
        or there exists an element of A with property (not P).
      This principle,
      which we shall call the principle of omniscience,
      lies at the root of most of the unconstructivities of classical mathematics.
      This is already true of the principle of omniscience in its simplest form:
        if {n(k)} is a sequence of integers,
        then either n(k) = 0 for some k
        or n(k) =/= 0 for all k.
      We shall call this the limited principle of omniscience.
      Theorem after theorem of classical mathematics
      depends in an essential way on the limited principle of omniscience,
      and is therefore not constructively valid.

      Some instances of this are the theorem that
      - a continuous real valued function
        on a closed bounded interval
        attains its maximum,
      - the fixed-point theorem
        for a continuous map of a closed cell into itself,
      - the ergodictheorem,
      - and the Hahn-Banach theorem.

      Nevertheless these theorems are not lost to constructive mathematics.
      Each of these theorems P has a constructive substitute Q,
      which is a constructively valid theorem
      Q implying P in the classical system
      by a more or less simple argument
      based on the limited principle of omniscience.
      For instance,
      the statement that
        every continuous function from a closed cell in euclidean space
        into itself admits a fixed point
      finds a constructive substitute in the statement that
        such a function admits a point
        which is arbitrarily near to its image.

    - The extent
      to which good constructive substitutes exist for the theorems of classical mathematics
      can be regarded as a demonstration that
      classical mathematics has a substantial underpinning of constructive truth.

    - When a classical mathematician claims he is a constructivist,
      he probably means he avoids the axiom of choice.
      This axiom is unique in its ability to trouble the conscience of the classical mathematician,
      but in fact it is not a real source of the unconstructivities of classical mathematics.
      A choice function exists in constructive mathematics,
      because a choice is implied by the very meaning of existence.

      Applications of the axiom of choice in classical mathematics
      either are irrelevant
      or are combined with a sweeping appeal to the principle of omniscience.
      The axiom of choice is used to extract elements from equivalence classes
      where they should never have been put in the first place.
      For instance,
      a real number should not be defined
      as an equivalence class of Cauchy sequences of rational numbers;
      there is no need to drag in the equivalence classes.
      The proof that the real numbers can be well ordered
      is an instance of a proof in which a sweeping use of the principle of omniscience
      is combined with an appeal to the axiom of choice.
      Such proofs offer little hope of constructivization.
      It is not likely that the theorem
        the real numbers can be well ordered
      will be given a constructive version
      consonant with the intuitive interpretation of the classical result.

    - Almost every conceivable type of resistance has been offered
      to a straightforward realistic treatment of mathematics,
      even by constructivists.

      Brouwer, who has done more for constructive mathematics than anyone else,
      thought it necessary to introduce a revolutionary, semimystical theory of the continuum.

      Weyl, a great mathematician who in practice suppressed his constructivist convictions,
      expressed the opinion that idealistic mathematics finds its justification in its applications to physics.

      Hilbert, who insisted on constructivity in meta-mathematics
      but believed the price of a constructive mathematics was too great,
      was willing to settle for consistency.

      Brouwer's disciples
      joined forces with the logicians
      in attempts to formalize constructive mathematics.

      Others seek constructive truth in the framework of recursive function theory.

      Still others look for a short cut to reality,
      a point of vantage
      which will suddenly reveal classical mathematics in a constructive light.
      None of these substitutes for a straightforward realistic approach has worked.
      It is no exaggeration to say that
      a straightforward realistic approach to mathematics has yet to be tried.
      It is time to make the attempt.

