translate/a-constructivist-manifesto.html

<div id="outline-container-orgb809f9c" class="outline-3">
<h3 id="orgb809f9c">原文</h3>
<div class="outline-text-3" id="text-orgb809f9c">
<ul class="org-ul">
<li><p><p></p><p>A set is defined</p><p>by describing exactly what must be done</p><p>in order to construct an element of the set</p><p>and what must be done in order to show that</p><p>two elements are equal.</p><p></p></p><p></p><p><p></p><p>There is no guarantee that</p><p>the description will be understood;</p><p>it may be that</p><p>an author thinks he has described a set with sufficient clarity</p><p>but a reader does not understand.</p><p></p></p><p></p><p><p></p><p>As an illustration</p><p>consider the set of all sequences {n(k)} of integers.</p><p>To construct such a sequence</p><p>we must give a rule</p><p>which associates an integer n(k)</p><p>to each positive integer k in such a way that</p><p>for each value of k</p><p>the associated integer n(k) can be determined</p><p>  in a finite number of steps</p><p>  by an entirely routine process.</p><p></p></p><p></p><p><p></p><p>Now this definition could perhaps be interpreted</p><p>to admit sequences {n(k)}</p><p>in which n(k) is constructed by a search,</p><p>the proof that the search actually produces a value of n(k)</p><p>after a finite number of steps</p><p>being given in some formal system.</p><p></p></p><p></p><p><p></p><p>Of course, we do not have this interpretation in mind,</p><p>but it is impossible</p><p>to consider every possible interpretation of our definition</p><p>and say whether that is what we have in mind.</p><p></p></p><p></p><p><p></p><p>There is always ambiguity,</p><p>but it becomes less and less as the reader continues to read</p><p>and discovers more and more of the author's intent,</p><p>modifying his interpretations if necessary</p><p>to fit the intentions of the author</p><p>as they continue to unfold.</p><p></p></p><p></p><p><p></p><p>At any stage of the exposition</p><p>the reader should be content</p><p>if he can give a reasonable interpretation</p><p>to account for everything the author has said.</p><p></p></p><p></p><p><p></p><p>The expositor himself</p><p>can never fully know all the possible ramifications of his definitions,</p><p>and he is subject to the same necessity of modifying his interpretations,</p><p>and sometimes his definitions as well,</p><p>to conform to the dictates of experience.</p><p></p></p></li>

<li><p>The constructive interpretations</p><p>of the mathematical connectives and quantifiers</p><p>have been established by Brouwer.</p></li>

<li><p>To prove the statement (P and Q)</p><p>we must prove the statement P and prove the statement Q,</p><p>just as in classical mathematics.</p></li>

<li><p>To provethe statement (P or Q)</p><p>we must either prove the statement P or prove the statement Q,</p><p>whereas in classical mathematics</p><p>it is possible to prove (P or Q) without proving either the statement P or the statement Q.</p></li>

<li><p>The connective 'implies' is more complicated.</p><p>To prove (P implies Q)</p><p>we must show that P necessarily entails Q,</p><p>or that Q is true whenever P is true.</p><p>The validity of the computational facts implicit in the statement P</p><p>must insure the validity of the computational facts implicitin the statement Q,</p><p>but the way this actually happens can only be seen</p><p>by looking at the proof of the statement (P implies Q).</p><p>Statements formed with this connective,</p><p>for example, statements of the type ((P implies Q) implies R),</p><p>have a less immediate meaning than the statements from which they are formed,</p><p>although in actual practice</p><p>this does not seem to lead to difficulties in interpretation.</p></li>

<li><p>The negation (not P) of a statement P</p><p>is the statement (P implies 0 = 1).</p><p>Classical mathematics makes no distinction</p><p>between the content of the statements P and not (not P),</p><p>whereas constructively</p><p>the latter is a weaker statement.</p></li>

<li><p><p></p><p>Brouwer's system makes essential use of negation in defining,</p><p>for instance, inequality and set complementation.</p><p>Thus two elements of a set A are unequal</p><p>  according to Brouwer</p><p>if the assumption of their equality</p><p>somehow allows us to compute that 0 = 1.</p><p></p></p><p></p><p><p></p><p>It is natural to want to replace this negativistic definition</p><p>by something more affirmative,</p><p>phrased as much as possible</p><p>in terms of specific computations</p><p>leading to specific results.</p><p></p></p><p></p><p><p></p><p>Brouwer himself does just this for the real number system,</p><p>introducing an affirmative and stronger relation of inequality</p><p>in addition to the negativistic relation already defined.</p><p>Experience shows that it is not necessary to define inequality in terms of negation.</p><p>For those cases in which an inequality relation is needed,</p><p>it is better to introduce it affirmatively.</p><p>The same remarks apply to set complementation.</p><p></p></p></li>

<li><p><p></p><p>Van Dantzig and others have gone as far as to propose that</p><p>negation could be entirely avoided in constructive mathematics.</p><p>Experience bears this out.</p><p>In many cases where we seem to be using negation</p><p>for instance, in the assertion that</p><p>  either a given integer is even or it is no</p><p>we are really asserting that</p><p>one of two finitely distinguishable alternatives actually obtains.</p><p></p></p><p></p><p><p></p><p>Without intending to establish a dogma,</p><p>we may continue to employ the language of negation</p><p>but reserve it for situations of this sort,</p><p>at least until experience changes our minds,</p><p>and for counterexamples and purposes of motivation.</p><p></p></p><p></p><p><p></p><p>This will have the advantage of making mathematics more immediate</p><p>and in certain situations forcing us to sharpen our results.</p><p></p></p></li>

<li><p><p></p><p>Proofs by contradiction</p><p>are constructively justified in finite situations.</p><p></p></p><p></p><p><p></p><p>When we have proved that</p><p>one of finitely many alternatives holds at a certain stage in the proof of a theorem,</p><p>to finish the proof of the theorem it is enough to show that</p><p>the theorem is a consequence of each of the alternatives.</p><p>Should one of the alternatives lead to a contradiction,</p><p>that is, imply 0 = 1,</p><p>we may either say that the alternative in question is ruled out</p><p>and pass on to the consideration of the other alternatives,</p><p>or we may be more meticulous</p><p>and prove that the theorem is a consequence of the equality 0 = 1.</p><p></p></p></li>

<li><p>A universal statement,</p><p>to the effect that</p><p>every element of a certain set A has a certain property P,</p><p>has the same meaning in constructive as in classical mathematics.</p><p>To prove such a statement</p><p>we must show by some general argument that</p><p>if x is any element of A,</p><p>then x has property P.</p></li>

<li><p><p></p><p>Constructive existence</p><p>is much more restrictive</p><p>than the ideal existence of classical mathematics.</p><p></p></p><p></p><p><p></p><p>The only way to show that an object exists</p><p>is to give a finite routine for finding it,</p><p>whereas in classical mathematics</p><p>other methods can be used.</p><p>In fact the following principle is valid in classical mathematics:</p><p>  Either all elements of A have property P</p><p>  or there exists an element of A with property (not P).</p><p>This principle,</p><p>which we shall call the principle of omniscience,</p><p>lies at the root of most of the unconstructivities of classical mathematics.</p><p>This is already true of the principle of omniscience in its simplest form:</p><p>  if {n(k)} is a sequence of integers,</p><p>  then either n(k) = 0 for some k</p><p>  or n(k) <code>/</code> 0 for all k.</p><p>We shall call this the limited principle of omniscience.</p><p>Theorem after theorem of classical mathematics</p><p>depends in an essential way on the limited principle of omniscience,</p><p>and is therefore not constructively valid.</p><p></p></p><p></p><p><p></p><p>Some instances of this are the theorem that</p><p></p></p><p><ul class="org-ul"></p><p><li><p>a continuous real valued function</p><p>on a closed bounded interval</p><p>attains its maximum,</p></li></p><p><li><p>the fixed-point theorem</p><p>for a continuous map of a closed cell into itself,</p></li></p><p><li><p>the ergodictheorem,</p></li></p><p><li><p>and the Hahn-Banach theorem.</p></li></ul></p><p><p></p><p>Nevertheless these theorems are not lost to constructive mathematics.</p><p>Each of these theorems P has a constructive substitute Q,</p><p>which is a constructively valid theorem</p><p>Q implying P in the classical system</p><p>by a more or less simple argument</p><p>based on the limited principle of omniscience.</p><p>For instance,</p><p>the statement that</p><p>  every continuous function from a closed cell in euclidean space</p><p>  into itself admits a fixed point</p><p>finds a constructive substitute in the statement that</p><p>  such a function admits a point</p><p>  which is arbitrarily near to its image.</p><p></p></p></li>

<li><p>The extent</p><p>to which good constructive substitutes exist for the theorems of classical mathematics</p><p>can be regarded as a demonstration that</p><p>classical mathematics has a substantial underpinning of constructive truth.</p></li>

<li><p><p></p><p>When a classical mathematician claims he is a constructivist,</p><p>he probably means he avoids the axiom of choice.</p><p>This axiom is unique in its ability to trouble the conscience of the classical mathematician,</p><p>but in fact it is not a real source of the unconstructivities of classical mathematics.</p><p>A choice function exists in constructive mathematics,</p><p>because a choice is implied by the very meaning of existence.</p><p></p></p><p></p><p><p></p><p>Applications of the axiom of choice in classical mathematics</p><p>either are irrelevant</p><p>or are combined with a sweeping appeal to the principle of omniscience.</p><p>The axiom of choice is used to extract elements from equivalence classes</p><p>where they should never have been put in the first place.</p><p>For instance,</p><p>a real number should not be defined</p><p>as an equivalence class of Cauchy sequences of rational numbers;</p><p>there is no need to drag in the equivalence classes.</p><p>The proof that the real numbers can be well ordered</p><p>is an instance of a proof in which a sweeping use of the principle of omniscience</p><p>is combined with an appeal to the axiom of choice.</p><p>Such proofs offer little hope of constructivization.</p><p>It is not likely that the theorem</p><p>  the real numbers can be well ordered</p><p>will be given a constructive version</p><p>consonant with the intuitive interpretation of the classical result.</p><p></p></p></li>

<li><p><p></p><p>Almost every conceivable type of resistance has been offered</p><p>to a straightforward realistic treatment of mathematics,</p><p>even by constructivists.</p><p></p></p><p></p><p><p></p><p>Brouwer, who has done more for constructive mathematics than anyone else,</p><p>thought it necessary to introduce a revolutionary, semimystical theory of the continuum.</p><p></p></p><p></p><p><p></p><p>Weyl, a great mathematician who in practice suppressed his constructivist convictions,</p><p>expressed the opinion that idealistic mathematics finds its justification in its applications to physics.</p><p></p></p><p></p><p><p></p><p>Hilbert, who insisted on constructivity in meta-mathematics</p><p>but believed the price of a constructive mathematics was too great,</p><p>was willing to settle for consistency.</p><p></p></p><p></p><p><p></p><p>Brouwer's disciples</p><p>joined forces with the logicians</p><p>in attempts to formalize constructive mathematics.</p><p></p></p><p></p><p><p></p><p>Others seek constructive truth in the framework of recursive function theory.</p><p></p></p><p></p><p><p></p><p>Still others look for a short cut to reality,</p><p>a point of vantage</p><p>which will suddenly reveal classical mathematics in a constructive light.</p><p>None of these substitutes for a straightforward realistic approach has worked.</p><p>It is no exaggeration to say that</p><p>a straightforward realistic approach to mathematics has yet to be tried.</p><p>It is time to make the attempt.</p><p></p></p></li></ul>
</div>
</div>
