source/_posts/translation/a-constructivist-manifesto.org
*** 記 任何使人心悅誠服的論證都是證明

    - 文章開頭的論述 詮釋着 Bishop 之後的名言
      A proof is any completely convincing argument
      即 任何使人心悅誠服的論證都是證明

    - 同時也詮釋着 布勞維爾意義上數學的主觀性
