translate/a-constructivist-manifesto.html

<div id="outline-container-org239e6" class="outline-3">
<h3 id="org239e6"><span class="todo _">記</span> 任何使人心悅誠服的論證都是證明</h3>
<div class="outline-text-3" id="text-org239e6">
<ul class="org-ul">
<li><p>文章開頭的論述 詮釋着 Bishop 之後的名言</p><p>A proof is any completely convincing argument</p><p>即 任何使人心悅誠服的論證都是證明</p></li>

<li><p>同時也詮釋着 布勞維爾意義上數學的主觀性</p></li></ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
</body>
</html>
